{
  "22.12.2025-28.12.2025": {
    "en": {
      "aries": "Aries, the coming days will bring you a fresh boost of energy and motivation to take action. You may feel a strong urge to make changes — don’t be afraid of it and trust your intuition, as it will guide you in the right direction. Greater harmony can appear in your relationships if you allow yourself honesty and spontaneity. This is a good moment to set ambitious goals and take the first step toward achieving them.",
      "taurus": "Taurus, this week it’s worth focusing more on yourself, as December may have been overly overwhelming for you. Try to rebuild your sense of balance and stability. You may also feel the need to refine your plans and take care of your comfort — both emotional and material. In relationships, greater openness will appear if you allow yourself to speak honestly about your desires. This is a good time to take the first step toward long-term changes.",
      "gemini": "Gemini, the beginning of the year looks quite dynamic for you. New ideas and opportunities for conversations may arise, opening doors to interesting and developmental possibilities. In the first days of the week, you’ll feel a sense of lightness and motivation to act. Relationships will gain momentum, but try not to get distracted and focus on what truly matters to you. This is an ideal moment to start something that has been on your mind for a long time.",
      "cancer": "Cancer, meetings with inspiring people can stimulate your mind and give you the courage to take on new challenges. Listen to your intuition, especially in personal matters, your inner wisdom will help you make the right decisions. Don't forget about your health, don't ignore the symptoms your body sends.",
      "leo": "Leo, this is an excellent time to listen to your own intuition and notice signals that may lead you towards new development opportunities. Take care of your psychological comfort and emotions, don't let the pressure of others take away your peace. Also consider helping others or small charitable actions that can bring you satisfaction and joy.",
      "virgo": "Virgo, the upcoming week is conducive to reflection and quiet. This is a good time to listen to yourself and your needs, both emotional and physical. Moments of solitude will help you organize your thoughts and gain distance from daily matters. In personal relationships, it's worth focusing on honesty and openness; conversations that previously seemed difficult will now bring relief and understanding. Don't avoid contact with loved ones, as small gestures bring people closer than words.",
      "libra": "Libra, this week you can expect pleasant surprises. Friends and loved ones will appreciate your presence, and warm words will boost your self-confidence. Appreciate small gestures, as they will have the greatest value this week. Also, don't forget to take care of your body and mind. A light walk, a moment of meditation, or a short rest will help you regain harmony and maintain a balance between responsibilities and regeneration.",
      "scorpio": "Scorpio, the upcoming week will bring you many positive vibrations and moments that will stimulate your creativity. Meetings and conversations with loved ones can spark enthusiasm in you, and it's worth using this energy to take action in your work and personal life. In emotional relationships, you will feel more confident, which will allow you to finally address topics that you have been postponing.",
      "sagittarius": "Sagittarius, the coming days will bring you many joyful moments and positive emotions. Your sense of humor will be contagious, so your surroundings will happily spend time in your company. At work, you can expect quick results of your actions if you maintain focus and patience. Also, remember your health; small signs of fatigue should not be ignored.",
      "capricorn": "Capricorn, the coming week will favor the pursuit of harmony and balance in life, both private and professional. Some days may bring minor tensions, but over time the atmosphere will become calmer, and you will feel a surge of positive energy. At work, productive days await you; your patience and accuracy will be noticed and appreciated. Don't forget to rest; you need to take care of your health.",
      "aquarius": "Aquarius, the week looks promising financially; there may be favorable offers or unexpected opportunities. However, remember to make decisions carefully and not be guided by impulse. It's also worth consulting your investment plans with someone trustworthy, which will help avoid mistakes. In private relationships, take a moment to talk to loved ones; support and honesty will help build a sense of security.",
      "pisces": "Pisces, the coming week will bring an opportunity to demonstrate intuition, both at work and in everyday situations. Although it's worth trusting your instincts, don't forget the facts. A healthy balance between heart and mind will help you avoid unnecessary conflicts and misunderstandings."
    },
    "pl": {
      "aries": "Baranie, nadchodzące dni przyniosą Ci nową dawkę energii i chęci do działania. Możesz poczuć silną potrzebę wprowadzania zmian — nie obawiaj się jej i zaufaj swojej intuicji, bo wskaże Ci właściwą drogę. W relacjach zapanuje większa równowaga, jeśli pozwolisz sobie na szczerość i naturalność. To dobry czas na stawianie ambitnych celów i wykonanie pierwszego kroku w stronę ich realizacji.",
      "taurus": "Byku, w tym tygodniu warto zwrócić większą uwagę na siebie, ponieważ grudzień mógł być dla Ciebie zbyt intensywny. Spróbuj odbudować poczucie równowagi i stabilności. Możesz również poczuć potrzebę dopracowania swoich planów oraz zadbania o komfort — zarówno emocjonalny, jak i materialny. W relacjach pojawi się więcej szczerości, jeśli pozwolisz sobie otwarcie mówić o swoich potrzebach. To dobry moment, by wykonać pierwszy krok w stronę długofalowych zmian.",
      "gemini": "Bliźniaku, początek roku zapowiada się dla Ciebie bardzo intensywnie. Pojawią się świeże pomysły oraz okazje do rozmów, które mogą otworzyć przed Tobą nowe, rozwojowe możliwości. W pierwszych dniach tygodnia poczujesz przypływ lekkości i energii do działania. Relacje przyspieszą, jednak warto zachować uważność i skupiać się na tym, co jest dla Ciebie naprawdę istotne. To doskonały czas, by rozpocząć coś, co od dawna kiełkowało w Twoich myślach.",
      "cancer": "Raku, spotkania z inspirującymi osobami mogą pobudzić Twój umysł i dodać odwagi do podejmowania nowych wyzwań. Wsłuchaj się w intuicję, zwłaszcza w sprawach osobistych, Twoja wewnętrzna mądrość pomoże Ci podjąć właściwe decyzje. Nie zapominaj o swoim zdrowiu, nie ignoruj objawów, które wysyła Twój organizm.",
      "leo": "Lwie, to doskonały czas, by wsłuchać się w własną intuicję i zauważyć sygnały, które mogą prowadzić Cię w stronę nowych możliwości rozwoju. Zadbaj o komfort psychiczny i swoje emocje, nie pozwól, by presja innych odbierała Ci spokój. Rozważ również pomoc innym lub drobne działania charytatywne, które mogą przynieść Ci satysfakcję i radość.",
      "virgo": "Panno, nadchodzący tydzień sprzyja refleksji i wyciszeniu. To dobry moment, by wsłuchać się w siebie i swoje potrzeby, zarówno emocjonalne, jak i fizyczne. Chwile samotności pozwolą uporządkować myśli i nabrać dystansu do codziennych spraw. W relacjach osobistych warto postawić na szczerość i otwartość, rozmowy, które wcześniej wydawały się trudne, teraz przyniosą ulgę i zrozumienie. Nie unikaj kontaktu z bliskimi, bo drobne gesty zbliżają bardziej niż słowa.",
      "libra": "Wago, w tym tygodniu możesz liczyć na miłe niespodzianki. Przyjaciele i bliscy docenią Twoją obecność, a ciepłe słowa wzmocnią Twoją pewność siebie. Doceniaj małe gesty, to one w tym tygodniu będą miały największą wartość. Nie zapominaj też o dbaniu o swoje ciało i umysł. Lekki spacer, chwila medytacji lub krótki odpoczynek pozwolą Ci odzyskać harmonię i utrzymać balans między obowiązkami a regeneracją.",
      "scorpio": "Skorpionie, nadchodzący tydzień przyniesie Ci wiele pozytywnych wibracji i chwil, które pobudzą Twoją kreatywność. Spotkania i rozmowy z bliskimi mogą wywołać w Tobie iskrę entuzjazmu, warto wykorzystać tę energię do działania w pracy i życiu osobistym. W relacjach uczuciowych poczujesz większą pewność siebie, co pozwoli Ci w końcu poruszyć tematy, które do tej pory odkładałeś.",
      "sagittarius": "Strzelcu, nadchodzące dni przyniosą Ci wiele radosnych chwil i pozytywnych emocji. Twoje poczucie humoru będzie zaraźliwe, dzięki czemu otoczenie chętnie spędzi czas w Twoim towarzystwie. W pracy możesz liczyć na szybkie efekty działań, jeśli zachowasz skupienie i cierpliwość. Pamiętaj też o zdrowiu, drobne oznaki przemęczenia nie powinny być ignorowane.",
      "capricorn": "Koziorożcu, najbliższy tydzień będzie sprzyjał poszukiwaniu harmonii i równowagi w życiu, zarówno prywatnym, jak i zawodowym. Niektóre dni mogą przynieść drobne napięcia, ale z czasem atmosfera stanie się spokojniejsza, a Ty poczujesz przypływ pozytywnej energii. W pracy czekają Cię produktywne dni, Twoja cierpliwość i dokładność zostaną zauważone i docenione. Nie zapominaj o odpoczynku, musisz zadbać o swoje zdrowie.",
      "aquarius": "Wodniku, finansowo tydzień zapowiada się obiecująco, mogą pojawić się korzystne propozycje lub niespodziewane okazje. Pamiętaj jednak, aby podejmować decyzje rozważnie i nie kierować się impulsem. Warto także skonsultować plany inwestycyjne z kimś zaufanym, co pozwoli uniknąć błędów. W relacjach prywatnych poświęć chwilę na rozmowę z bliskimi, wsparcie i szczerość pomogą zbudować poczucie bezpieczeństwa.",
      "pisces": "Rybo, nadchodzący tydzień przyniesie okazję do wykazania się intuicją, zarówno w pracy, jak i w codziennych sytuacjach. Choć warto ufać przeczuciom, nie zapominaj o faktach. Zdrowy balans między sercem a rozumem pozwoli Ci uniknąć niepotrzebnych konfliktów i nieporozumień."
    },
    "de": {
      "aries": "Widder, die kommenden Tage bringen dir einen neuen Energieschub und viel Motivation zum Handeln. Du könntest ein starkes Bedürfnis verspüren, Veränderungen vorzunehmen — hab keine Angst davor und vertraue deiner Intuition, denn sie wird dich in die richtige Richtung führen. In Beziehungen kann mehr Harmonie entstehen, wenn du dir Ehrlichkeit und Spontaneität erlaubst. Jetzt ist ein guter Zeitpunkt, ehrgeizige Ziele zu setzen und den ersten Schritt zu ihrer Verwirklichung zu machen.",
      "taurus": "Stier, in dieser Woche solltest du dich stärker auf dich selbst konzentrieren, da der Dezember für dich sehr reizüberflutend gewesen sein könnte. Versuche, dein Gefühl von Stabilität und Ausgeglichenheit neu aufzubauen. Möglicherweise verspürst du auch das Bedürfnis, deine Pläne zu verfeinern und für mehr Komfort zu sorgen — sowohl emotional als auch materiell. In Beziehungen kann mehr Offenheit entstehen, wenn du über deine Wünsche sprichst. Jetzt ist ein guter Zeitpunkt, um den ersten Schritt in Richtung langfristiger Veränderungen zu machen.",
      "gemini": "Zwillinge, der Jahresanfang gestaltet sich für dich recht dynamisch. Neue Ideen und Gesprächsmöglichkeiten können sich ergeben und interessante, entwicklungsfördernde Türen öffnen. In den ersten Tagen der Woche wirst du einen Schub an Leichtigkeit und Tatendrang spüren. Beziehungen nehmen an Tempo zu, doch versuche, dich nicht zu verzetteln und dich auf das zu konzentrieren, was dir wirklich wichtig ist. Jetzt ist der ideale Zeitpunkt, um etwas zu beginnen, das dir schon lange im Kopf herumschwirrt.",
      "cancer": "Krebs, Begegnungen mit inspirierenden Menschen können Ihren Geist anregen und Ihnen den Mut geben, neue Herausforderungen anzunehmen. Hören Sie auf Ihre Intuition, besonders in persönlichen Angelegenheiten, Ihre innere Weisheit wird Ihnen helfen, die richtigen Entscheidungen zu treffen. Vergessen Sie nicht Ihre Gesundheit, ignorieren Sie nicht die Symptome, die Ihr Körper Ihnen sendet.",
      "leo": "Löwe, dies ist eine ausgezeichnete Zeit, um auf Ihre eigene Intuition zu hören und Signale zu bemerken, die Sie zu neuen Entwicklungsmöglichkeiten führen können. Sorge für psychisches Wohlbefinden und deine Emotionen, lass nicht zu, dass der Druck anderer dir deinen Frieden nimmt. Überlege auch, anderen zu helfen oder kleine wohltätige Aktionen zu unternehmen, die dir Zufriedenheit und Freude bringen können.",
      "virgo": "Jungfrau, die kommende Woche fördert Reflexion und Stille. Dies ist eine gute Zeit, um auf sich selbst und Ihre Bedürfnisse, sowohl emotional als auch körperlich, zu hören. Augenblicke der Einsamkeit helfen Ihnen, Ihre Gedanken zu ordnen und Abstand zu den Alltagsangelegenheiten zu gewinnen. In persönlichen Beziehungen ist es wert, auf Ehrlichkeit und Offenheit zu setzen; Gespräche, die zuvor schwierig schienen, werden nun Erleichterung und Verständnis bringen. Vermeiden Sie den Kontakt mit Ihren Lieben nicht, denn kleine Gesten bringen Menschen näher als Worte.",
      "libra": "Waage, in dieser Woche können Sie mit angenehmen Überraschungen rechnen. Freunde und Angehörige werden Ihre Anwesenheit schätzen, und warme Worte werden Ihr Selbstvertrauen stärken. Schätzen Sie kleine Gesten, denn sie werden in dieser Woche den größten Wert haben. Vergessen Sie auch nicht, auf Ihren Körper und Geist zu achten. Ein leichter Spaziergang, ein Moment der Meditation oder eine kurze Pause helfen Ihnen, Harmonie wiederzuerlangen und ein Gleichgewicht zwischen Verpflichtungen und Regeneration zu halten.",
      "scorpio": "Skorpion, die kommende Woche wird Ihnen viele positive Schwingungen und Momente bringen, die Ihre Kreativität anregen. Begegnungen und Gespräche mit Lieben können in Ihnen einen Funken Enthusiasmus entfachen, und es lohnt sich, diese Energie für Handlungen in Arbeit und Privatleben zu nutzen. In emotionalen Beziehungen werden Sie mehr Selbstvertrauen spüren, was Ihnen erlaubt, endlich Themen anzusprechen, die Sie bisher aufgeschoben haben.",
      "sagittarius": "Schütze, die kommenden Tage werden Ihnen viele fröhliche Momente und positive Emotionen bringen. Ihr Humor wird ansteckend sein, sodass Ihre Umgebung gerne Zeit in Ihrer Gesellschaft verbringt. Bei der Arbeit können Sie mit schnellen Ergebnissen Ihrer Handlungen rechnen, wenn Sie Konzentration und Geduld bewahren. Denken Sie auch an Ihre Gesundheit; kleine Anzeichen von Müdigkeit sollten nicht ignoriert werden.",
      "capricorn": "Steinbock, die kommende Woche wird der Suche nach Harmonie und Ausgleich im Leben, sowohl privat als auch beruflich, förderlich sein. Manche Tage können kleine Spannungen bringen, aber mit der Zeit wird die Atmosphäre ruhiger, und Sie werden einen Anstieg positiver Energie spüren. Bei der Arbeit erwarten Sie produktive Tage; Ihre Geduld und Genauigkeit werden bemerkt und geschätzt werden. Vergessen Sie nicht, sich auszuruhen; Sie müssen sich um Ihre Gesundheit kümmern.",
      "aquarius": "Wassermann, finanziell verspricht die Woche vielversprechend zu sein; es könnten vorteilhafte Angebote oder unerwartete Gelegenheiten auftauchen. Denken Sie jedoch daran, Entscheidungen sorgfältig zu treffen und sich nicht von Impulsen leiten zu lassen. Es lohnt sich auch, Ihre Investitionspläne mit jemandem Vertrauenswürdigem zu besprechen, was Ihnen helfen wird, Fehler zu vermeiden. In privaten Beziehungen nehmen Sie sich einen Moment Zeit, um mit Ihren Lieben zu sprechen; Unterstützung und Ehrlichkeit helfen, ein Gefühl der Sicherheit aufzubauen.",
      "pisces": "Fische, die kommende Woche wird Ihnen die Gelegenheit bieten, Ihre Intuition zu zeigen, sowohl bei der Arbeit als auch in Alltagssituationen. Obwohl es sich lohnt, Ihren Instinkten zu vertrauen, vergessen Sie nicht die Fakten. Ein gesunder Ausgleich zwischen Herz und Verstand wird Ihnen helfen, unnötige Konflikte und Missverständnisse zu vermeiden."
    }
  },

  "29.12.2025-04.01.2026": {
    "en": {
      "aries": "This week, Aries, you may encounter situations that could slightly overwhelm you. Remember to maintain balance; short breaks, a walk, or even a one-day trip will help you regenerate and gain perspective on daily responsibilities. Make time for those who are most important to you; shared conversations will be like an injection of positive energy!",
      "taurus": "Count your money in the coming week to make wise decisions, but avoid unnecessary spending. Postpone certain purchases until later to avoid regretting impulsive buys. New, inspiring acquaintances will appear in your life. Give people a chance; someone might bring you joy and positive energy.",
      "gemini": "Gemini, in your personal relationships, pay attention to the need for closeness, especially since you'll have a bit more time for family and friends - make use of it. Someone in your circle may need your support but is too shy to ask. Show that you're reliable. Also, think about your New Year's resolutions; it's worth writing them down and achieving them later!",
      "cancer": "Scorpio, this week you may discover that old skills or acquaintances will open up new opportunities. Use them wisely, and they will bring satisfaction and benefits. Remember to keep a positive attitude. Avoid conflicts, being offended, and excessive criticism of others. Respond to sarcastic remarks with a smile.",
      "leo": "Leo, in emotional relationships, opt for calm and understanding communication. Someone close may need a quiet conversation, so listen attentively and avoid overly harsh words. This week is also favorable for shared joyful moments. Meetings with friends and family will be a source of positive energy, so take the opportunity for relaxation and fun.",
      "virgo": "Virgo, this is a good time to listen closely to your needs and reflect on which matters truly deserve your attention. This will help you manage stress more effectively and make decisions that are aligned with who you are. When it comes to finances, be cautious, as careless actions could lead to serious problems in the future. Toward the end of the month, expect an intriguing piece of news that may significantly influence your path ahead.",
      "libra": "Libra, your mind is full of ideas right now, so it’s best to choose one clear goal and focus on achieving it. This approach will help you get the best results and bring a sense of fulfillment from work done well. Toward the end of the month, a pleasant surprise awaits you, bringing lots of joy and positive emotions.",
      "scorpio": "Cancer, remember that not every discussion or argument is worth your energy. Save your strength for matters that truly matter. This is also a good time to close old chapters and let go of past resentments. Don’t be afraid of making such decisions, even if they may bring up someone else’s emotions — right now, it’s important to stand up for yourself.",
      "sagittarius": "Sagittarius, the coming week will give you the opportunity to view your life from a new perspective. Not all the information reaching you is reliable, so exercise caution in your interactions and don’t reveal all your plans. Around the turn of December to January, pleasant surprises await you in love and personal relationships.",
      "capricorn": "Capricorn, at work you may receive a collaboration offer or a project that requires a creative approach. It’s worth carefully considering all options before making a decision. In your personal relationships, honesty will be your ally — misunderstandings can arise from unclear communication, so strive to be open and clear. Also, allow yourself a moment of rest; you truly need it.",
      "aquarius": "Aquarius, the coming week will bring you plenty of energy and the courage to make changes in both your personal and professional life. An opportunity for collaboration with someone who can offer a fresh perspective may arise. It’s worth taking on new challenges, as they can lead to tangible successes. Although the start of the week might be a bit chaotic, you will quickly regain balance if you approach things calmly and systematically.",
      "pisces": "Pisces, someone around you may try to influence your plans, but it’s important to stay true to your own vision. Remember, you don’t have to give in at all costs. Emotionally, you may face a period of instability, so listen to yourself and your needs. Don’t miss opportunities for fun and meetings with people who matter to you — this is a time that can bring joy and strengthen bonds."
    },
    "pl": {
      "aries": "W tym tygodniu, Baranie, możesz się spotkać z sytuacjami, które mogą Cię nieco przeciążyć. Pamiętaj o równowadze, krótkie przerwy, spacer lub nawet jednodniowa wycieczka pozwolą Ci się zregenerować i nabrać dystansu do codziennych obowiązków. Znajdź czas dla tych, którzy są dla Ciebie najważniejsi, wspólne rozmowy będą jak zastrzyk pozytywnej energii!",
      "taurus": "Policz swoje pieniądze w nadchodzącym tygodniu, aby podejmować mądre decyzje, ale unikaj zbytecznych wydatków. Odkładaj pewne zakupy na później, żeby nie żałować impulsywnych zakupów. W Twoim życiu pojawią się nowe, inspirujące znajomości. Daj szansę ludziom, ktoś może przynieść ci radość i pozytywną energię.",
      "gemini": "Bliźniaku, skup się na relacjach, bo będziesz miał trochę więcej czasu na bliskich - wykorzystaj to. Ktoś wokół może potrzebować pomocy, ale się wstydzi - pokaż, że jesteś tu dla nich. Zastanów się też nad noworocznymi planami, warto je zapisać i później osiągnąć!",
      "cancer": "Raku, tym tygodniu możesz odkryć, że stare umiejętności lub znajomi otworzą nowe szanse. Wykorzystaj je mądrze, a przyniosą zadowolenie i korzyści. Pamiętaj o pozytywnym podejściu. Unikaj kłótni, obrażania się i zbyt krytycznych sędziów. Na złośliwe komentarze odpowiadaj z uśmiechem.",
      "leo": "Lwie, w sferze uczuć warto zachować opanowanie i empatię. Ktoś bliski może potrzebować spokojnej, szczerej rozmowy, dlatego słuchaj z uwagą i powstrzymaj się od zbyt ostrych reakcji. Nadchodzące dni sprzyjają też wspólnemu cieszeniu się drobnymi przyjemnościami. Czas spędzony z przyjaciółmi i rodziną przyniesie dużo dobrej energii — to idealny moment na relaks i radosne spotkania.",
      "virgo": "Panno, to dobry moment, aby uważnie przyjrzeć się swoim potrzebom i określić, które sprawy naprawdę zasługują na Twoją uwagę. Dzięki temu łatwiej opanujesz napięcie i będziesz podejmować decyzje w zgodzie ze sobą. W kwestiach finansowych warto zachować rozwagę, ponieważ nieprzemyślane działania mogą w przyszłości przynieść poważniejsze kłopoty. Pod koniec miesiąca może pojawić się intrygująca wiadomość, która znacząco wpłynie na dalszy bieg Twoich spraw.",
      "libra": "Wago, masz teraz wiele pomysłów i myśli, dlatego najlepiej będzie obrać jeden konkretny cel i konsekwentnie do niego dążyć. Takie podejście pozwoli Ci osiągnąć najlepsze efekty i da poczucie spełnienia z dobrze wykonanych zadań. Pod koniec miesiąca czeka Cię miła niespodzianka, która przyniesie sporo radości i pozytywnych emocji.",
      "scorpio": "Skorpionie, miej na uwadze, że nie każda rozmowa czy spór zasługuje na Twoje zaangażowanie. Zachowaj energię na kwestie, które są naprawdę istotne. To także odpowiedni czas, by domknąć niedokończone sprawy i odciąć się od dawnych żalów. Nie obawiaj się takich decyzji, nawet jeśli mogą one wywołać czyjeś emocje — teraz ważne jest, by zadbać o własne potrzeby.",
      "sagittarius": "Strzelcu, nadchodzący tydzień da Ci szansę spojrzenia na swoje życie z innej perspektywy. Nie wszystkie informacje, które do Ciebie docierają, są wiarygodne, dlatego zachowaj ostrożność w kontaktach i nie ujawniaj wszystkich swoich planów. Na przełomie grudnia i stycznia w sferze uczuć i relacji osobistych mogą Cię czekać przyjemne niespodzianki.",
      "capricorn": "Koziorożcu, w pracy możesz otrzymać propozycję współpracy lub projekt wymagający twórczego podejścia. Warto dokładnie rozważyć wszystkie możliwości, zanim podejmiesz decyzję. W sferze prywatnej szczerość będzie Twoim sprzymierzeńcem — niedopowiedzenia mogą prowadzić do nieporozumień, dlatego staraj się komunikować jasno i otwarcie. Pozwól sobie też na chwilę wytchnienia, naprawdę tego potrzebujesz.",
      "aquarius": "Wodniku, nadchodzący tydzień obdarzy Cię dużą energią i odwagą do wprowadzania zmian zarówno w życiu prywatnym, jak i zawodowym. Pojawi się możliwość współpracy z osobą, która wniesie świeże spojrzenie. Warto podejmować nowe wyzwania, ponieważ mogą przynieść konkretne sukcesy. Choć początek tygodnia może być nieco chaotyczny, szybko odzyskasz równowagę, jeśli będziesz działać spokojnie i metodycznie.",
      "pisces": "Rybo, ktoś w Twoim otoczeniu może próbować wpłynąć na Twoje plany, ale ważne jest, aby pozostać wierną własnej wizji. Pamiętaj, że nie musisz ustępować za wszelką cenę. W sferze emocji czeka Cię okres pewnej niestabilności, dlatego wsłuchuj się w siebie i swoje potrzeby. Nie rezygnuj z okazji do zabawy i spotkań z osobami dla Ciebie ważnymi — to czas, który może przynieść radość i wzmocnić relacje."
    },
    "de": {
      "aries": "Diese Woche, Widder, könnten Sie auf Situationen stoßen, die Sie etwas überfordern könnten. Denken Sie an Ausgleich; kurze Pausen, ein Spaziergang oder sogar ein Tagesausflug helfen Ihnen, sich zu regenerieren und Abstand zu den täglichen Pflichten zu gewinnen. Nehmen Sie sich Zeit für diejenigen, die Ihnen am wichtigsten sind; gemeinsame Gespräche werden wie eine Injektion positiver Energie sein!",
      "taurus": "Zähle dein Geld in der kommenden Woche, um kluge Entscheidungen zu treffen, aber vermeide unnötige Ausgaben. Schiebe bestimmte Einkäufe auf später, um keine impulsiven Käufe zu bereuen. Neue, inspirierende Bekanntschaften werden in dein Leben treten. Gib den Menschen eine Chance; jemand könnte dir Freude und positive Energie bringen.",
      "gemini": "Zwillinge, konzentriere dich auf deine Beziehungen, besonders weil du etwas mehr Zeit für Familie und Freunde haben wirst. Nutze das. Jemand in deiner Umgebung könnte deine Unterstützung brauchen, schämt sich aber, danach zu fragen. Zeige, dass man sich auf dich verlassen kann. Überlege dir auch deine Neujahrsvorsätze; es lohnt sich, sie aufzuschreiben und später umzusetzen!",
      "cancer": "Krebs, in dieser Woche könnte sich herausstellen, dass deine früheren Fähigkeiten oder bekannten Kontakte neue Verdienstmöglichkeiten eröffnen. Nutze sie mit Bedacht, und sie werden dir Zufriedenheit und greifbare Vorteile in naher Zukunft bringen. Denke an die Kraft einer positiven Einstellung. Vermeide Konflikte, sei nicht nachtragend und übe keine übermäßige Kritik an anderen. Auf spitze Bemerkungen solltest du ruhig oder mit einem Lächeln reagieren — das wird dir zugutekommen.",
      "leo": "Löwe, in emotionalen Beziehungen lohnt es sich, auf Ruhe und Einfühlungsvermögen zu setzen. Eine nahestehende Person könnte ein ruhiges und ehrliches Gespräch brauchen, daher höre aufmerksam zu und vermeide scharfe Reaktionen. Die kommenden Tage sind außerdem günstig, um gemeinsame kleine Freuden zu genießen. Zeit mit Freunden und Familie schenkt dir positive Energie — eine ideale Phase für Entspannung und fröhliche Treffen.",
      "virgo": "Jungfrau, jetzt ist ein guter Zeitpunkt, um auf deine eigenen Bedürfnisse zu hören und zu überlegen, welche Angelegenheiten wirklich deine Aufmerksamkeit verdienen. Das hilft dir, Stress besser zu kontrollieren und Entscheidungen im Einklang mit dir selbst zu treffen. In finanziellen Fragen ist Vorsicht geboten, da unüberlegte Schritte später zu größeren Problemen führen können. Gegen Ende des Monats kannst du mit einer spannenden Nachricht rechnen, die deine Zukunft deutlich beeinflussen könnte.",
      "libra": "Waage, dein Kopf ist derzeit voller Ideen, daher ist es sinnvoll, dir ein konkretes Ziel zu setzen und dich konsequent auf dessen Umsetzung zu konzentrieren. So erzielst du die besten Ergebnisse und empfindest Zufriedenheit über gut erledigte Aufgaben. Gegen Ende des Monats erwartet dich eine angenehme Überraschung, die dir viel Freude und positive Gefühle bereiten wird.",
      "scorpio": "Skorpion, denke daran, dass nicht jede Diskussion oder jeder Streit deine Energie wert ist. Bewahre deine Kraft für Dinge, die wirklich von Bedeutung sind. Jetzt ist auch ein guter Moment, um alte Kapitel abzuschließen und vergangene Verletzungen loszulassen. Hab keine Angst vor diesen Entscheidungen, selbst wenn sie bei anderen starke Gefühle auslösen — im Moment ist es wichtig, für dich selbst einzustehen.",
      "sagittarius": "Schütze, die kommende Woche bietet dir die Gelegenheit, dein Leben aus einer neuen Perspektive zu betrachten. Nicht alle Informationen, die dich erreichen, sind verlässlich, daher solltest du vorsichtig in deinen Kontakten sein und nicht alle Pläne preisgeben. Zum Jahreswechsel von Dezember zu Januar erwarten dich erfreuliche Überraschungen in Liebesangelegenheiten und persönlichen Beziehungen.",
      "capricorn": "Steinbock, bei der Arbeit könnte dir ein Kooperationsangebot oder ein Projekt begegnen, das ein kreatives Herangehen erfordert. Es ist ratsam, alle Optionen gründlich zu prüfen, bevor du eine Entscheidung triffst. In privaten Beziehungen wird Ehrlichkeit dein Verbündeter sein — Missverständnisse können aus Unklarheiten entstehen, daher bemühe dich um klare und offene Kommunikation. Gönn dir auch eine Auszeit, du brauchst sie wirklich.",
      "aquarius": "Wassermann, die kommende Woche schenkt dir viel Energie und den Mut, Veränderungen im privaten und beruflichen Leben anzugehen. Es könnte sich eine Gelegenheit zur Zusammenarbeit mit jemandem ergeben, der neue Perspektiven einbringt. Es lohnt sich, neue Herausforderungen anzunehmen, denn sie können zu greifbaren Erfolgen führen. Auch wenn der Wochenanfang etwas chaotisch sein könnte, wirst du schnell wieder ins Gleichgewicht kommen, wenn du ruhig und methodisch vorgehst.",
      "pisces": "Fische, jemand aus deinem Umfeld könnte versuchen, deine Pläne zu beeinflussen, doch es ist wichtig, deiner eigenen Vision treu zu bleiben. Denke daran, dass du nicht um jeden Preis nachgeben musst. Emotional erwartet dich eine Phase gewisser Instabilität, also höre auf dich selbst und deine Bedürfnisse. Verzichte nicht auf Gelegenheiten zu Vergnügen und Treffen mit Menschen, die dir wichtig sind — diese Zeit kann Freude bringen und Beziehungen stärken."
    }
  }
}
