{
  "19.01.2026-25.01.2026": {
    "pl": {
      "aries": "Baranie, w tym tygodniu czeka Cię kilka decyzji wymagających odwagi i rozwagi. Przemyśl dokładnie każdy krok, szczególnie w sprawach, które nie układają się po Twojej myśli. Pamiętaj również o zdrowiu – to fundament, bez którego trudno osiągnąć cokolwiek.",
      "taurus": "Byku, w nadchodzącym tygodniu mogą pojawić się drobne napięcia w kontaktach z innymi. Staraj się nie brać ich zbyt osobiście – nikt nie jest doskonały, a chwile wątpliwości zdarzają się każdemu. Sytuacje mogą być czasem stresujące, ale z czasem okaże się, czy naprawdę warto było się tym przejmować.",
      "gemini": "Bliźniaku, w tym tygodniu nadarza się dobra okazja, by rozpocząć nowe przedsięwzięcia lub odnowić dawne znajomości. W kontaktach z innymi warto zachować skupienie – poświęcaj uwagę jednej osobie na raz, aby uniknąć nieporozumień. Weekend przyniesie Ci chwilę relaksu oraz inspirację do dalszego działania.",
      "cancer": "Raku, w tym tygodniu stanie przed Tobą wiele wyzwań, ale pojawią się też okazje, by udowodnić własną siłę i determinację. W kwestiach finansowych zachowaj ostrożność – unikaj pochopnych inwestycji i ryzyka, bo nawet drobne błędy mogą mieć spore konsekwencje. Zwracaj uwagę na to, z kim spędzasz czas, i nie obawiaj się odpuścić sytuacji, która nie jest tego warta.",
      "leo": "Lwie, nadchodzi pracowity tydzień pełen obowiązków, choć możesz nie odczuwać zbytniej chęci, by się nimi zajmować. Postaraj się jednak zmobilizować, aby zachować spokój ducha, zwłaszcza że wkrótce planujesz sobie wolne. Wieczory warto poświęcić na drobne przyjemności tylko dla siebie – naprawdę na to zasługujesz!",
      "virgo": "Panno, w tym tygodniu warto zmierzyć się ze sprawami, o których wolałabyś nie myśleć. Nie poddawaj się, jeśli coś nie idzie po Twojej myśli – wytrwała praca przynosi efekty. Jeśli sytuacja wymaga gestu w stronę kogoś innego, nie wahaj się go wykonać. Zamiast szukać problemów, daj ludziom szansę. Świat się nie zawali, a Ty poczujesz się znacznie lepiej.",
      "libra": "Wago, w tym tygodniu Twoje ambitne zamierzenia mają dużą szansę powodzenia, lecz na razie trzymaj je dla siebie – ktoś może poczuć się zagrożony. To dobry czas zarówno na miłość, jak i na relaks. W domu pojawi się okazja do szczerej rozmowy, która poprawi atmosferę – nie musi być długa, wystarczy otwartość i szczerość. Przyniesie to ulgę nie tylko Tobie, ale również Twoim bliskim.",
      "scorpio": "Skorpionie, w tym tygodniu otworzy się przed Tobą nowy etap, w którym ważne będzie pokazanie swojej prawdziwej natury i autentyczności. Poczujesz pragnienie zmian i zaczniesz wprowadzać je w życie. Sprzyja Ci również szybkie załatwianie codziennych spraw. Okazuj bliskim wsparcie, jeśli go potrzebują, i unikaj zbędnych kłótni – czas lepiej poświęcić na konstruktywne działania. Kieruj się swoją intuicją w każdym działaniu.",
      "sagittarius": "Strzelcu, początek nadchodzącego tygodnia może być wymagający, ale popołudnia będą już spokojniejsze. Nie obawiaj się podejmować trudnych decyzji – jeśli dobrze je przemyślisz, wkrótce będziesz mieć wiele powodów do radości.",
      "capricorn": "Koziorożcu, w tym tygodniu postaraj się przede wszystkim zadbać o swoje samopoczucie i sprawić, by tydzień był udany – to najlepszy sposób na odpoczynek. W kwestiach finansowych zachowaj rozsądek i unikaj pochopnych decyzji. Uda Ci się rozwiązać długo odkładane problemy, a odczuwaną ulgę warto świętować w gronie bliskich.",
      "aquarius": "Wodniku, drugi tydzień stycznia zapowiada się całkiem udanie. Skup się na dopracowaniu szczegółów ważnych spraw, a szczególnie poświęć czas finansom domowym. Jeśli utrzymasz wszystko pod kontrolą, unikniesz problemów. W sferze zawodowej czeka Cię kilka wyzwań – nie obawiaj się podejmować decyzji i zachowaj otwartość. Wkrótce docenisz swoją konsekwencję i wysiłek.",
      "pisces": "Rybo, w nadchodzącym tygodniu spojrzysz na kolejne dni z optymizmem i opracujesz plan działania, aby nie przegapić żadnej ważnej sprawy. Pojawią się również rozwiązania problemów, na które długo czekałeś, choć wymagać to będzie od Ciebie dodatkowego zaangażowania. Nie obiecuj innym zbyt wiele, bo mogłoby być trudno dotrzymać tych zobowiązań."
    },
    "en": {
      "aries": "Aries, this week you will face several decisions that require both courage and careful consideration. Think through each step, especially in matters that aren’t fully in your favor. Also, pay attention to your health – it is the foundation on which everything else depends.",
      "taurus": "Taurus, this week may bring minor tensions in your interactions with others. Try not to take them too personally – no one is perfect, and moments of doubt happen to everyone. Things might feel a bit stressful at times, but in the end, time will show whether it was worth worrying about.",
      "gemini": "Gemini, this week presents a good opportunity to start new projects or reconnect with old acquaintances. In your interactions, try to stay focused – give your attention to one person at a time to avoid misunderstandings. The weekend will bring a moment of rest and inspiration for pursuing your next goals.",
      "cancer": "Cancer, this week will bring many challenges, but also opportunities to demonstrate your inner strength and determination. In financial matters, exercise caution – avoid hasty investments and risky decisions, as even small mistakes could be costly. Pay attention to the company you keep, and don’t hesitate to step back from situations that aren’t worth your energy.",
      "leo": "Leo, a busy week lies ahead, filled with responsibilities, even if you may not feel motivated to tackle them. Try to stay disciplined to maintain peace of mind, especially since you have some time off planned soon. Spend your evenings on small surprises and treats for yourself – you truly deserve it!",
      "virgo": "Virgo, this week it’s important to face matters you might prefer to avoid. Don’t give up if things don’t go your way – hard work truly pays off. If the situation calls for reaching out to someone, don’t hesitate to do so. Instead of looking for faults, give others a chance. The world won’t fall apart, and you will feel much better.",
      "libra": "Libra, this week your ambitious plans have a strong chance of success, but for now, keep them to yourself – someone might feel threatened. It’s a good time for love and relaxation. At home, an opportunity for an honest conversation will arise, improving the atmosphere – it doesn’t need to be long, just open and sincere. This will bring relief not only to you but also to your loved ones.",
      "scorpio": "Scorpio, this week a new chapter will open for you, emphasizing authenticity and revealing your true self. You will feel a desire for change and start taking action. The week also favors handling tasks efficiently. Show care to your loved ones if they need it, and avoid unnecessary conflicts – your time is better spent on constructive actions. Follow your intuition in everything you do.",
      "sagittarius": "Sagittarius, the beginning of the upcoming week may be challenging, but afternoons will bring a calmer atmosphere. Don’t hesitate to make difficult decisions – if you analyze them carefully, you will soon have many reasons to feel joyful.",
      "capricorn": "Capricorn, this week focus on feeling good and making it a positive week for yourself – it’s the best form of rest. Exercise caution in financial matters and avoid hasty decisions. You will manage to resolve long-postponed issues, and it’s worth celebrating the relief you gain with your loved ones.",
      "aquarius": "Aquarius, the second week of January looks promising for you. Focus on attending to the details of important matters, especially your household finances. Keeping everything under control will help you avoid problems. You will face several challenges at work – don’t hesitate to make decisions and stay open-minded. Soon, you will appreciate your own consistency and effort.",
      "pisces": "Pisces, in the coming week you will look at the days ahead with optimism and create a plan of action to ensure nothing important is overlooked. Solutions to long-standing problems will also appear, though they will require extra effort on your part. Avoid promising too much to others, as it may be difficult to keep all commitments."
    },
    "de": {
      "aries": "Widder, diese Woche stehen einige Entscheidungen an, die Mut und Bedacht erfordern. Überlege jeden Schritt genau, besonders in Angelegenheiten, die nicht ganz zu deinen Gunsten verlaufen. Achte zudem auf deine Gesundheit – sie ist die Basis, auf der alles andere aufbaut.",
      "taurus": "Stier, in dieser Woche könnten kleine Spannungen in deinen zwischenmenschlichen Beziehungen auftreten. Versuche, sie nicht zu persönlich zu nehmen – niemand ist perfekt, und Momente des Zweifelns passieren jedem. Die Situationen können manchmal etwas stressig sein, aber mit der Zeit wird sich zeigen, ob es sich wirklich gelohnt hat, sich darüber Sorgen zu machen.",
      "gemini": "Zwillinge, diese Woche bietet eine gute Gelegenheit, neue Projekte zu starten oder alte Kontakte wieder aufzufrischen. In deinen Beziehungen ist es wichtig, konzentriert zu bleiben – widme jeweils einer Person deine Aufmerksamkeit, um Missverständnisse zu vermeiden. Das Wochenende bringt dir eine Pause und Inspiration für die Umsetzung weiterer Ziele.",
      "cancer": "Krebs, in dieser Woche stehen dir viele Herausforderungen bevor, aber auch Gelegenheiten, deine innere Stärke und Entschlossenheit zu zeigen. In finanziellen Angelegenheiten sei vorsichtig – vermeide übereilte Investitionen und riskante Entscheidungen, da selbst kleine Fehler teuer werden können. Achte darauf, mit wem du deine Zeit verbringst, und scheue dich nicht, Situationen loszulassen, die es nicht wert sind.",
      "leo": "Löwe, eine arbeitsreiche Woche steht bevor, voller Verpflichtungen, auch wenn du vielleicht nicht besonders motiviert bist, sie anzugehen. Versuche dennoch, dich zu mobilisieren, um inneren Frieden zu bewahren, besonders da du bald freie Tage geplant hast. Widme deine Abende kleinen Überraschungen und Verwöhnmomenten nur für dich – du hast es wirklich verdient!",
      "virgo": "Jungfrau, in dieser Woche ist es wichtig, sich den Themen zu stellen, denen du lieber ausweichen würdest. Gib nicht auf, wenn etwas nicht nach deinem Plan läuft – harte Arbeit zahlt sich wirklich aus. Wenn die Situation einen Schritt auf jemand anderen erfordert, zögere nicht, ihn zu tun. Anstatt nach Fehlern zu suchen, gib anderen eine Chance. Die Welt wird nicht untergehen, und du wirst dich deutlich besser fühlen.",
      "libra": "Waage, in dieser Woche stehen deine ehrgeizigen Pläne unter guten Vorzeichen, aber behalte sie vorerst für dich – jemand könnte sich dadurch herausgefordert fühlen. Es ist eine gute Zeit für Liebe und Entspannung. Zu Hause ergibt sich die Gelegenheit für ein ehrliches Gespräch, das die Stimmung verbessert – es muss nicht lang sein, Offenheit und Ehrlichkeit genügen. Dies wird nicht nur dir, sondern auch deinen Liebsten Erleichterung bringen.",
      "scorpio": "Skorpion, in dieser Woche eröffnet sich ein neuer Abschnitt für dich, in dem Authentizität und das Zeigen deines wahren Selbst wichtig sind. Du wirst den Wunsch nach Veränderung spüren und beginnen, aktiv zu handeln. Die Woche begünstigt auch das zügige Erledigen von Aufgaben. Zeige deinen Liebsten Fürsorge, wenn sie sie brauchen, und vermeide unnötige Streitigkeiten – die Zeit ist besser für konstruktives Handeln genutzt. Verlasse dich bei allem, was du tust, auf deine Intuition.",
      "sagittarius": "Schütze, der Wochenanfang kann herausfordernd sein, doch die Nachmittage verlaufen bereits ruhiger. Scheue dich nicht, schwierige Entscheidungen zu treffen – wenn du sie gut überdenkst, wirst du bald viele Gründe zur Freude haben.",
      "capricorn": "Steinbock, in dieser Woche solltest du dich darauf konzentrieren, dich selbst wohlzufühlen und die Woche für dich positiv zu gestalten – das ist die beste Form der Erholung. Sei bei finanziellen Angelegenheiten vorsichtig und vermeide übereilte Entscheidungen. Es wird dir gelingen, lange aufgeschobene Probleme zu lösen, und die dadurch gewonnene Erleichterung lohnt es sich, im Kreis der Liebsten zu feiern.",
      "aquarius": "Wassermann, die zweite Januarwoche verspricht für dich recht erfolgreich zu werden. Konzentriere dich darauf, die Details wichtiger Angelegenheiten zu beachten, besonders in Bezug auf die Haushaltsfinanzen. Wenn du alles unter Kontrolle hältst, wirst du Probleme vermeiden. Im beruflichen Bereich warten einige Herausforderungen auf dich – scheue dich nicht, Entscheidungen zu treffen, und bleibe offen. Schon bald wirst du deine eigene Konsequenz und deinen Einsatz zu schätzen wissen.",
      "pisces": "Fische, in der kommenden Woche wirst du den Blick optimistisch auf die kommenden Tage richten und einen Plan erstellen, um nichts Wichtiges zu verpassen. Auch Lösungen für langwierige Probleme werden sich zeigen, allerdings erfordert dies zusätzlichen Einsatz von deiner Seite. Versprich anderen nicht zu viel, da es schwierig sein könnte, alle Verpflichtungen einzuhalten."
    }
  }
}
