{
  "05.01.2026-11.01.2026": {
    "en": {
      "aries": "Aries, the coming days will bring you a fresh boost of energy and motivation to take action. You may feel a strong urge to make changes — don’t be afraid of it and trust your intuition, as it will guide you in the right direction. Greater harmony can appear in your relationships if you allow yourself honesty and spontaneity. This is a good moment to set ambitious goals and take the first step toward achieving them.",
      "taurus": "Taurus, this week it’s worth focusing more on yourself, as December may have been overly overwhelming for you. Try to rebuild your sense of balance and stability. You may also feel the need to refine your plans and take care of your comfort — both emotional and material. In relationships, greater openness will appear if you allow yourself to speak honestly about your desires. This is a good time to take the first step toward long-term changes.",
      "gemini": "Gemini, the beginning of the year looks quite dynamic for you. New ideas and opportunities for conversations may arise, opening doors to interesting and developmental possibilities. In the first days of the week, you’ll feel a sense of lightness and motivation to act. Relationships will gain momentum, but try not to get distracted and focus on what truly matters to you. This is an ideal moment to start something that has been on your mind for a long time.",
      "cancer": "Cancer, in the first week of January you may feel the need to slow down and tune in to your emotions. This is a good time to organize domestic matters and create an environment that supports a sense of security. In relationships, you can count on the support of loved ones, but it’s also important to communicate your needs clearly. Reflect on your professional life — it might be worth considering a change of job.",
      "leo": "Leo, a highly creative week lies ahead of you, giving you the chance to showcase your talents and regain confidence in yourself. You may experience a sudden surge of inspiration that encourages you to start new projects or make bold decisions. In relationships, there will be more warmth and mutual attentiveness — both from you and toward you. This is a good moment to remember that your needs are just as important as the needs of others.",
      "virgo": "Virgo, the beginning of the year will bring you a sense of clarity and order in matters that previously seemed confusing or unclear. This is a favorable time for planning and setting priorities — your consistency will soon start to deliver visible results. In relationships, you may feel the need for greater stability, so it’s worth having honest conversations about your expectations. The energy of this week also supports taking care of your health and making small but beneficial changes to your daily habits.",
      "libra": "Libra, the beginning of the year will bring you a strong surge of energy, helping you finally move forward with an idea you’ve been postponing for a long time. Use this impulse wisely, but remember to keep your emotions in check and avoid pouring all your enthusiasm into it at once. Acting too quickly may create unnecessary tension in your relationships with loved ones. In the middle of the week, you might experience a bit of chaos, but don’t worry — everything will fall into place as planned. Instead of fighting or trying to resolve conflicts forcefully, slow down and allow yourself time to recharge.",
      "scorpio": "Scorpio, the beginning of the year will show you that your intuition is one of your greatest strengths. You’ll sense the moods of others with remarkable sensitivity, helping you avoid unnecessary tension. Someone around you may behave a bit mysteriously, but it’s best not to jump to conclusions and simply focus on your own matters. If you’re single, an opportunity to start a connection that may surprise you with its intensity lies ahead. Allow yourself to be guided by your emotions — the start of the year is perfect for that. Those in relationships will feel a renewed warmth and a desire for conversations that strengthen mutual trust.",
      "sagittarius": "Sagittarius, the beginning of the year will be especially favorable for you. You’ll devote a lot of time to rebuilding and strengthening relationships with loved ones. Certain conversations will help you view some matters with greater distance. You’ll realize that not every problem requires an immediate response and that sometimes it’s better to let go of what’s beyond your control. Over the weekend, you may discover a talent or interest that had previously remained in the background. Dedicate time and energy to it, as it may bring not only personal fulfillment but also financial benefits in the future.",
      "capricorn": "Capricorn, this week focus on taking care of yourself and your health. Toward the end of the year, your body was already signaling a need for rest, so now is the time to prioritize recovery and slow down your pace. Long walks, quiet moments with a book, or a home spa routine will help you regain balance. If possible, plan a short trip — even a weekend getaway can bring you peace and renewed energy.",
      "aquarius": "Aquarius, this week you will focus a lot on financial matters, which can have a significant impact on your life, especially if you take the time to analyze your budget and make thoughtful decisions. In relationships, your loved ones will appreciate your attention, and conversations with them will strengthen bonds and bring satisfaction. Remember to maintain a balance between work and personal life — extremes are never good. If you feel uncertain, trust your intuition, as it rarely lets you down.",
      "pisces": "Pisces, the upcoming period will be quite reflective for you. There may even be an unexpected return of someone from your past. A conversation with this person could bring comfort or important clarifications if you allow yourself to be open. You will likely feel the need to confide in someone close — don’t hesitate to do so. Support from trusted people, especially those who view situations more rationally, can be very helpful. The start of the year is a good time for making changes and exploring new directions in your life."
    },
    "pl": {
      "aries": "Baranie, nadchodzące dni przyniosą Ci nową dawkę energii i chęci do działania. Możesz poczuć silną potrzebę wprowadzania zmian — nie obawiaj się jej i zaufaj swojej intuicji, bo wskaże Ci właściwą drogę. W relacjach zapanuje większa równowaga, jeśli pozwolisz sobie na szczerość i naturalność. To dobry czas na stawianie ambitnych celów i wykonanie pierwszego kroku w stronę ich realizacji.",
      "taurus": "Byku, w tym tygodniu warto zwrócić większą uwagę na siebie, ponieważ grudzień mógł być dla Ciebie zbyt intensywny. Spróbuj odbudować poczucie równowagi i stabilności. Możesz również poczuć potrzebę dopracowania swoich planów oraz zadbania o komfort — zarówno emocjonalny, jak i materialny. W relacjach pojawi się więcej szczerości, jeśli pozwolisz sobie otwarcie mówić o swoich potrzebach. To dobry moment, by wykonać pierwszy krok w stronę długofalowych zmian.",
      "gemini": "Bliźniaku, początek roku zapowiada się dla Ciebie bardzo intensywnie. Pojawią się świeże pomysły oraz okazje do rozmów, które mogą otworzyć przed Tobą nowe, rozwojowe możliwości. W pierwszych dniach tygodnia poczujesz przypływ lekkości i energii do działania. Relacje przyspieszą, jednak warto zachować uważność i skupiać się na tym, co jest dla Ciebie naprawdę istotne. To doskonały czas, by rozpocząć coś, co od dawna kiełkowało w Twoich myślach.",
      "cancer": "Raku, w pierwszym tygodniu stycznia możesz odczuć potrzebę zwolnienia tempa i głębszego wsłuchania się w swoje emocje. To odpowiedni czas, aby uporządkować sprawy domowe i stworzyć wokół siebie atmosferę sprzyjającą poczuciu bezpieczeństwa. W relacjach możesz liczyć na wsparcie bliskich, jednak pamiętaj, by jasno wyrażać swoje potrzeby. Zastanów się również nad sprawami zawodowymi — być może nadszedł moment, by rozważyć zmianę pracy.",
      "leo": "Lwie, przed Tobą wyjątkowo twórczy tydzień, który pozwoli Ci zaprezentować swoje umiejętności i odzyskać wiarę we własne możliwości. Możesz doświadczyć nagłego przypływu inspiracji, zachęcającego do rozpoczynania nowych projektów lub podejmowania śmiałych decyzji. W relacjach pojawi się więcej ciepła i wzajemnej uważności — zarówno z Twojej strony, jak i ze strony innych. To dobry czas, by przypomnieć sobie, że Twoje potrzeby są tak samo ważne jak potrzeby osób wokół Ciebie.",
      "virgo": "Panno, początek roku przyniesie Ci poczucie jasności i uporządkowania spraw, które wcześniej mogły wydawać się chaotyczne lub niejasne. To sprzyjający czas na planowanie oraz ustalanie priorytetów — Twoja systematyczność szybko zacznie przynosić widoczne rezultaty. W relacjach możesz odczuć potrzebę większej stabilności, dlatego warto otwarcie porozmawiać o swoich oczekiwaniach. Energia tego tygodnia wspiera także troskę o zdrowie i wprowadzanie drobnych, ale korzystnych zmian w codziennych nawykach.",
      "libra": "Wago, początek roku przyniesie Ci silny przypływ energii, który pomoże ruszyć z pomysłem odkładanym od dłuższego czasu. Skorzystaj z tego impulsu, ale pamiętaj, by zachować umiar i kontrolować emocje, nie angażując całego swojego entuzjazmu naraz. Zbyt pochopne reakcje mogą wywołać niepotrzebne napięcia w relacjach z bliskimi. W połowie tygodnia możesz odczuć chwilowy chaos, jednak nie martw się — wszystko ułoży się zgodnie z planem. Zamiast walczyć i szukać rozwiązań konfliktów na siłę, zwolnij tempo i pozwól sobie na regenerację.",
      "scorpio": "Skorpionie, początek roku uświadomi Ci, że Twoja intuicja jest jednym z Twoich największych atutów. Z dużą wrażliwością będziesz wyczuwać nastroje innych, co pomoże Ci uniknąć zbędnych napięć. Ktoś z Twojego otoczenia może zachowywać się w tajemniczy sposób, jednak nie warto wyciągać pochopnych wniosków — najlepiej skupić się na własnych sprawach. Jeśli jesteś singlem lub singielką, przed Tobą szansa na znajomość, która zaskoczy Cię swoją intensywnością. Pozwól sobie na emocje — początek roku sprzyja takim doświadczeniom. Osoby w związkach poczują więcej ciepła i chęci do rozmów, które umacniają wzajemne zaufanie.",
      "sagittarius": "Strzelcu, początek roku będzie dla Ciebie wyjątkowo sprzyjający. Wiele uwagi poświęcisz odbudowie i umacnianiu relacji z bliskimi. Niektóre rozmowy pozwolą Ci spojrzeć na różne sprawy z większym dystansem. Zrozumiesz, że nie każdy problem wymaga natychmiastowej reakcji i czasem warto odpuścić to, na co nie masz wpływu. W weekend możesz odkryć w sobie talent lub pasję, które dotąd pozostawały na drugim planie. Warto poświęcić im czas i energię, ponieważ mogą przynieść nie tylko satysfakcję, ale również finansowe korzyści w przyszłości.",
      "capricorn": "Koziorożcu, w tym tygodniu szczególnie zadbaj o siebie i swoje zdrowie. Już pod koniec roku Twój organizm dawał sygnały, że potrzebuje odpoczynku, dlatego warto postawić na regenerację i wolniejsze tempo. Długie spacery, chwile z książką lub domowe rytuały relaksacyjne pomogą Ci odzyskać równowagę. Jeśli masz taką możliwość, zaplanuj krótki wyjazd — nawet weekend poza domem przyniesie Ci spokój i nową dawkę energii.",
      "aquarius": "Wodniku, w tym tygodniu poświęcisz sporo uwagi sprawom finansowym, które mogą znacząco wpłynąć na Twoje życie, zwłaszcza jeśli dokładnie przeanalizujesz budżet i podejmiesz przemyślane decyzje. W relacjach bliskie osoby docenią Twoją troskę, a rozmowy z nimi wzmocnią więzi i przyniosą satysfakcję. Pamiętaj, aby zachować równowagę między pracą a życiem prywatnym — skrajności nie są wskazane. Jeśli będziesz się wahać, zaufaj swojej intuicji, bo rzadko Cię zawodzi.",
      "pisces": "Rybo, nadchodzący czas będzie dla Ciebie bardziej refleksyjny. Może nawet pojawić się niespodziewany powrót kogoś z przeszłości. Rozmowa z tą osobą może przynieść Ci ukojenie lub istotne wyjaśnienia, jeśli otworzysz się na szczerość. Prawdopodobnie poczujesz potrzebę zwierzenia się komuś bliskiemu — nie wahaj się tego zrobić. Wsparcie osób, którym ufasz, a zwłaszcza tych patrzących na sprawy bardziej racjonalnie, może okazać się bardzo pomocne. Początek roku sprzyja wprowadzaniu zmian i nowych kierunków w życiu."
    },
    "de": {
      "aries": "Widder, die kommenden Tage bringen dir einen neuen Energieschub und viel Motivation zum Handeln. Du könntest ein starkes Bedürfnis verspüren, Veränderungen vorzunehmen — hab keine Angst davor und vertraue deiner Intuition, denn sie wird dich in die richtige Richtung führen. In Beziehungen kann mehr Harmonie entstehen, wenn du dir Ehrlichkeit und Spontaneität erlaubst. Jetzt ist ein guter Zeitpunkt, ehrgeizige Ziele zu setzen und den ersten Schritt zu ihrer Verwirklichung zu machen.",
      "taurus": "Stier, in dieser Woche solltest du dich stärker auf dich selbst konzentrieren, da der Dezember für dich sehr reizüberflutend gewesen sein könnte. Versuche, dein Gefühl von Stabilität und Ausgeglichenheit neu aufzubauen. Möglicherweise verspürst du auch das Bedürfnis, deine Pläne zu verfeinern und für mehr Komfort zu sorgen — sowohl emotional als auch materiell. In Beziehungen kann mehr Offenheit entstehen, wenn du über deine Wünsche sprichst. Jetzt ist ein guter Zeitpunkt, um den ersten Schritt in Richtung langfristiger Veränderungen zu machen.",
      "gemini": "Zwillinge, der Jahresanfang gestaltet sich für dich recht dynamisch. Neue Ideen und Gesprächsmöglichkeiten können sich ergeben und interessante, entwicklungsfördernde Türen öffnen. In den ersten Tagen der Woche wirst du einen Schub an Leichtigkeit und Tatendrang spüren. Beziehungen nehmen an Tempo zu, doch versuche, dich nicht zu verzetteln und dich auf das zu konzentrieren, was dir wirklich wichtig ist. Jetzt ist der ideale Zeitpunkt, um etwas zu beginnen, das dir schon lange im Kopf herumschwirrt.",
      "cancer": "Krebs, in der ersten Januarwoche könntest du das Bedürfnis verspüren, das Tempo zu drosseln und dich intensiver mit deinen Emotionen zu beschäftigen. Jetzt ist ein guter Moment, um häusliche Angelegenheiten zu ordnen und eine Atmosphäre zu schaffen, die Sicherheit vermittelt. In Beziehungen kannst du auf die Unterstützung deiner Liebsten zählen, solltest jedoch auch deine Bedürfnisse klar kommunizieren. Denke über deine berufliche Situation nach — vielleicht ist es an der Zeit, einen Jobwechsel in Betracht zu ziehen.",
      "leo": "Löwe, vor dir liegt eine besonders kreative Woche, in der du deine Talente zeigen und dein Selbstvertrauen stärken kannst. Ein plötzlicher Inspirationsschub könnte dich dazu ermutigen, neue Projekte zu beginnen oder mutige Entscheidungen zu treffen. In Beziehungen wird es mehr Wärme und gegenseitige Aufmerksamkeit geben — sowohl von dir als auch dir gegenüber. Jetzt ist ein guter Zeitpunkt, dir bewusst zu machen, dass deine Bedürfnisse genauso wichtig sind wie die der anderen.",
      "virgo": "Jungfrau, der Jahresbeginn bringt dir Klarheit und Ordnung in Angelegenheiten, die zuvor chaotisch oder schwer verständlich wirkten. Jetzt ist ein guter Zeitpunkt für Planung und Prioritätensetzung — deine Konsequenz wird bald sichtbare Ergebnisse liefern. In Beziehungen könntest du ein stärkeres Bedürfnis nach Stabilität verspüren, daher lohnt sich ein offenes Gespräch über deine Erwartungen. Die Energie dieser Woche begünstigt außerdem die Sorge um die Gesundheit und kleine, positive Veränderungen im Alltag.",
      "libra": "Waage, der Jahresbeginn bringt dir einen starken Energieschub, mit dem du endlich ein lange aufgeschobenes Vorhaben angehen kannst. Nutze diesen Impuls bewusst, achte jedoch darauf, deine Emotionen im Gleichgewicht zu halten und nicht deinen gesamten Enthusiasmus auf einmal einzusetzen. Zu schnelle Reaktionen könnten unnötige Spannungen in Beziehungen zu nahestehenden Menschen verursachen. Zur Wochenmitte kann etwas Chaos entstehen, doch keine Sorge — am Ende wird sich alles wie geplant fügen. Anstatt zu kämpfen oder Konflikte um jeden Preis lösen zu wollen, drossle das Tempo und gönn dir Zeit zur Erholung.",
      "scorpio": "Skorpion, der Jahresbeginn wird dir zeigen, dass deine Intuition eine deiner größten Stärken ist. Mit besonderer Feinfühligkeit wirst du die Stimmungen anderer wahrnehmen und so unnötige Spannungen vermeiden. Jemand in deinem Umfeld könnte sich etwas geheimnisvoll verhalten, doch ziehe keine vorschnellen Schlüsse und konzentriere dich lieber auf deine eigenen Angelegenheiten. Bist du Single, bietet sich dir die Chance auf eine Begegnung, die dich mit ihrer Intensität überraschen kann. Lass dich von deinen Gefühlen leiten — der Jahresanfang ist genau die richtige Zeit dafür. Menschen in festen Beziehungen spüren mehr Wärme und den Wunsch nach Gesprächen, die das gegenseitige Vertrauen stärken.",
      "sagittarius": "Schütze, der Jahresbeginn wird für dich besonders günstig verlaufen. Du wirst viel Zeit darauf verwenden, Beziehungen zu nahestehenden Menschen zu festigen und neu aufzubauen. Manche Gespräche ermöglichen dir einen distanzierteren Blick auf bestimmte Angelegenheiten. Du erkennst, dass nicht jedes Problem sofortiges Handeln erfordert und dass es manchmal besser ist, Dinge loszulassen, auf die du keinen Einfluss hast. Am Wochenende könntest du ein Talent oder Interesse entdecken, das bisher im Hintergrund geblieben ist. Widme ihm Zeit und Energie, denn es kann dir nicht nur Zufriedenheit, sondern in Zukunft auch finanzielle Vorteile bringen.",
      "capricorn": "Steinbock, in dieser Woche solltest du besonders auf dich und deine Gesundheit achten. Bereits zum Jahresende hat dein Körper deutlich signalisiert, dass er Erholung braucht, daher ist jetzt eine ruhigere Gangart und Regeneration angesagt. Lange Spaziergänge, Zeit mit einem Buch oder ein entspannendes Home-Spa helfen dir, dein Gleichgewicht wiederzufinden. Wenn möglich, plane einen kurzen Ausflug — selbst ein Wochenendtrip kann dir Ruhe und neue Energie schenken.",
      "aquarius": "Wassermann, in dieser Woche wirst du dich stark mit finanziellen Angelegenheiten beschäftigen, die dein Leben wesentlich beeinflussen können, besonders wenn du dir Zeit für eine sorgfältige Budgetanalyse und überlegte Entscheidungen nimmst. In Beziehungen werden deine Liebsten deine Aufmerksamkeit schätzen, und Gespräche mit ihnen stärken die Bindungen und bringen Zufriedenheit. Denke daran, das Gleichgewicht zwischen Arbeit und Privatleben zu wahren — Extreme sind nie gut. Wenn du unsicher bist, vertraue deiner Intuition, denn sie täuscht dich selten.",
      "pisces": "Fische, die kommende Zeit wird für dich eher nachdenklich sein. Es könnte sogar eine unerwartete Rückkehr einer Person aus deiner Vergangenheit geben. Ein Gespräch mit dieser Person kann dir Trost spenden oder wichtige Klarheit bringen, wenn du bereit bist, dich zu öffnen. Wahrscheinlich verspürst du das Bedürfnis, dich jemandem Nahestehenden anzuvertrauen — zögere nicht, dies zu tun. Die Unterstützung von vertrauenswürdigen Menschen, insbesondere von denen, die Situationen rationaler betrachten, kann sehr hilfreich sein. Der Jahresbeginn eignet sich gut, um Veränderungen vorzunehmen und neue Wege im Leben zu erkunden."
    }
  },
  "29.12.2025-04.01.2026": {
    "en": {
      "aries": "This week, Aries, you may encounter situations that could slightly overwhelm you. Remember to maintain balance; short breaks, a walk, or even a one-day trip will help you regenerate and gain perspective on daily responsibilities. Make time for those who are most important to you; shared conversations will be like an injection of positive energy!",
      "taurus": "Count your money in the coming week to make wise decisions, but avoid unnecessary spending. Postpone certain purchases until later to avoid regretting impulsive buys. New, inspiring acquaintances will appear in your life. Give people a chance; someone might bring you joy and positive energy.",
      "gemini": "Gemini, in your personal relationships, pay attention to the need for closeness, especially since you'll have a bit more time for family and friends - make use of it. Someone in your circle may need your support but is too shy to ask. Show that you're reliable. Also, think about your New Year's resolutions; it's worth writing them down and achieving them later!",
      "cancer": "Scorpio, this week you may discover that old skills or acquaintances will open up new opportunities. Use them wisely, and they will bring satisfaction and benefits. Remember to keep a positive attitude. Avoid conflicts, being offended, and excessive criticism of others. Respond to sarcastic remarks with a smile.",
      "leo": "Leo, in emotional relationships, opt for calm and understanding communication. Someone close may need a quiet conversation, so listen attentively and avoid overly harsh words. This week is also favorable for shared joyful moments. Meetings with friends and family will be a source of positive energy, so take the opportunity for relaxation and fun.",
      "virgo": "Virgo, this is a good time to listen closely to your needs and reflect on which matters truly deserve your attention. This will help you manage stress more effectively and make decisions that are aligned with who you are. When it comes to finances, be cautious, as careless actions could lead to serious problems in the future. Toward the end of the month, expect an intriguing piece of news that may significantly influence your path ahead.",
      "libra": "Libra, your mind is full of ideas right now, so it’s best to choose one clear goal and focus on achieving it. This approach will help you get the best results and bring a sense of fulfillment from work done well. Toward the end of the month, a pleasant surprise awaits you, bringing lots of joy and positive emotions.",
      "scorpio": "Cancer, remember that not every discussion or argument is worth your energy. Save your strength for matters that truly matter. This is also a good time to close old chapters and let go of past resentments. Don’t be afraid of making such decisions, even if they may bring up someone else’s emotions — right now, it’s important to stand up for yourself.",
      "sagittarius": "Sagittarius, the coming week will give you the opportunity to view your life from a new perspective. Not all the information reaching you is reliable, so exercise caution in your interactions and don’t reveal all your plans. Around the turn of December to January, pleasant surprises await you in love and personal relationships.",
      "capricorn": "Capricorn, at work you may receive a collaboration offer or a project that requires a creative approach. It’s worth carefully considering all options before making a decision. In your personal relationships, honesty will be your ally — misunderstandings can arise from unclear communication, so strive to be open and clear. Also, allow yourself a moment of rest; you truly need it.",
      "aquarius": "Aquarius, the coming week will bring you plenty of energy and the courage to make changes in both your personal and professional life. An opportunity for collaboration with someone who can offer a fresh perspective may arise. It’s worth taking on new challenges, as they can lead to tangible successes. Although the start of the week might be a bit chaotic, you will quickly regain balance if you approach things calmly and systematically.",
      "pisces": "Pisces, someone around you may try to influence your plans, but it’s important to stay true to your own vision. Remember, you don’t have to give in at all costs. Emotionally, you may face a period of instability, so listen to yourself and your needs. Don’t miss opportunities for fun and meetings with people who matter to you — this is a time that can bring joy and strengthen bonds."
    },
    "pl": {
      "aries": "W tym tygodniu, Baranie, możesz się spotkać z sytuacjami, które mogą Cię nieco przeciążyć. Pamiętaj o równowadze, krótkie przerwy, spacer lub nawet jednodniowa wycieczka pozwolą Ci się zregenerować i nabrać dystansu do codziennych obowiązków. Znajdź czas dla tych, którzy są dla Ciebie najważniejsi, wspólne rozmowy będą jak zastrzyk pozytywnej energii!",
      "taurus": "Policz swoje pieniądze w nadchodzącym tygodniu, aby podejmować mądre decyzje, ale unikaj zbytecznych wydatków. Odkładaj pewne zakupy na później, żeby nie żałować impulsywnych zakupów. W Twoim życiu pojawią się nowe, inspirujące znajomości. Daj szansę ludziom, ktoś może przynieść ci radość i pozytywną energię.",
      "gemini": "Bliźniaku, skup się na relacjach, bo będziesz miał trochę więcej czasu na bliskich - wykorzystaj to. Ktoś wokół może potrzebować pomocy, ale się wstydzi - pokaż, że jesteś tu dla nich. Zastanów się też nad noworocznymi planami, warto je zapisać i później osiągnąć!",
      "cancer": "Raku, tym tygodniu możesz odkryć, że stare umiejętności lub znajomi otworzą nowe szanse. Wykorzystaj je mądrze, a przyniosą zadowolenie i korzyści. Pamiętaj o pozytywnym podejściu. Unikaj kłótni, obrażania się i zbyt krytycznych sędziów. Na złośliwe komentarze odpowiadaj z uśmiechem.",
      "leo": "Lwie, w sferze uczuć warto zachować opanowanie i empatię. Ktoś bliski może potrzebować spokojnej, szczerej rozmowy, dlatego słuchaj z uwagą i powstrzymaj się od zbyt ostrych reakcji. Nadchodzące dni sprzyjają też wspólnemu cieszeniu się drobnymi przyjemnościami. Czas spędzony z przyjaciółmi i rodziną przyniesie dużo dobrej energii — to idealny moment na relaks i radosne spotkania.",
      "virgo": "Panno, to dobry moment, aby uważnie przyjrzeć się swoim potrzebom i określić, które sprawy naprawdę zasługują na Twoją uwagę. Dzięki temu łatwiej opanujesz napięcie i będziesz podejmować decyzje w zgodzie ze sobą. W kwestiach finansowych warto zachować rozwagę, ponieważ nieprzemyślane działania mogą w przyszłości przynieść poważniejsze kłopoty. Pod koniec miesiąca może pojawić się intrygująca wiadomość, która znacząco wpłynie na dalszy bieg Twoich spraw.",
      "libra": "Wago, masz teraz wiele pomysłów i myśli, dlatego najlepiej będzie obrać jeden konkretny cel i konsekwentnie do niego dążyć. Takie podejście pozwoli Ci osiągnąć najlepsze efekty i da poczucie spełnienia z dobrze wykonanych zadań. Pod koniec miesiąca czeka Cię miła niespodzianka, która przyniesie sporo radości i pozytywnych emocji.",
      "scorpio": "Skorpionie, miej na uwadze, że nie każda rozmowa czy spór zasługuje na Twoje zaangażowanie. Zachowaj energię na kwestie, które są naprawdę istotne. To także odpowiedni czas, by domknąć niedokończone sprawy i odciąć się od dawnych żalów. Nie obawiaj się takich decyzji, nawet jeśli mogą one wywołać czyjeś emocje — teraz ważne jest, by zadbać o własne potrzeby.",
      "sagittarius": "Strzelcu, nadchodzący tydzień da Ci szansę spojrzenia na swoje życie z innej perspektywy. Nie wszystkie informacje, które do Ciebie docierają, są wiarygodne, dlatego zachowaj ostrożność w kontaktach i nie ujawniaj wszystkich swoich planów. Na przełomie grudnia i stycznia w sferze uczuć i relacji osobistych mogą Cię czekać przyjemne niespodzianki.",
      "capricorn": "Koziorożcu, w pracy możesz otrzymać propozycję współpracy lub projekt wymagający twórczego podejścia. Warto dokładnie rozważyć wszystkie możliwości, zanim podejmiesz decyzję. W sferze prywatnej szczerość będzie Twoim sprzymierzeńcem — niedopowiedzenia mogą prowadzić do nieporozumień, dlatego staraj się komunikować jasno i otwarcie. Pozwól sobie też na chwilę wytchnienia, naprawdę tego potrzebujesz.",
      "aquarius": "Wodniku, nadchodzący tydzień obdarzy Cię dużą energią i odwagą do wprowadzania zmian zarówno w życiu prywatnym, jak i zawodowym. Pojawi się możliwość współpracy z osobą, która wniesie świeże spojrzenie. Warto podejmować nowe wyzwania, ponieważ mogą przynieść konkretne sukcesy. Choć początek tygodnia może być nieco chaotyczny, szybko odzyskasz równowagę, jeśli będziesz działać spokojnie i metodycznie.",
      "pisces": "Rybo, ktoś w Twoim otoczeniu może próbować wpłynąć na Twoje plany, ale ważne jest, aby pozostać wierną własnej wizji. Pamiętaj, że nie musisz ustępować za wszelką cenę. W sferze emocji czeka Cię okres pewnej niestabilności, dlatego wsłuchuj się w siebie i swoje potrzeby. Nie rezygnuj z okazji do zabawy i spotkań z osobami dla Ciebie ważnymi — to czas, który może przynieść radość i wzmocnić relacje."
    },
    "de": {
      "aries": "Diese Woche, Widder, könnten Sie auf Situationen stoßen, die Sie etwas überfordern könnten. Denken Sie an Ausgleich; kurze Pausen, ein Spaziergang oder sogar ein Tagesausflug helfen Ihnen, sich zu regenerieren und Abstand zu den täglichen Pflichten zu gewinnen. Nehmen Sie sich Zeit für diejenigen, die Ihnen am wichtigsten sind; gemeinsame Gespräche werden wie eine Injektion positiver Energie sein!",
      "taurus": "Zähle dein Geld in der kommenden Woche, um kluge Entscheidungen zu treffen, aber vermeide unnötige Ausgaben. Schiebe bestimmte Einkäufe auf später, um keine impulsiven Käufe zu bereuen. Neue, inspirierende Bekanntschaften werden in dein Leben treten. Gib den Menschen eine Chance; jemand könnte dir Freude und positive Energie bringen.",
      "gemini": "Zwillinge, konzentriere dich auf deine Beziehungen, besonders weil du etwas mehr Zeit für Familie und Freunde haben wirst. Nutze das. Jemand in deiner Umgebung könnte deine Unterstützung brauchen, schämt sich aber, danach zu fragen. Zeige, dass man sich auf dich verlassen kann. Überlege dir auch deine Neujahrsvorsätze; es lohnt sich, sie aufzuschreiben und später umzusetzen!",
      "cancer": "Krebs, in dieser Woche könnte sich herausstellen, dass deine früheren Fähigkeiten oder bekannten Kontakte neue Verdienstmöglichkeiten eröffnen. Nutze sie mit Bedacht, und sie werden dir Zufriedenheit und greifbare Vorteile in naher Zukunft bringen. Denke an die Kraft einer positiven Einstellung. Vermeide Konflikte, sei nicht nachtragend und übe keine übermäßige Kritik an anderen. Auf spitze Bemerkungen solltest du ruhig oder mit einem Lächeln reagieren — das wird dir zugutekommen.",
      "leo": "Löwe, in emotionalen Beziehungen lohnt es sich, auf Ruhe und Einfühlungsvermögen zu setzen. Eine nahestehende Person könnte ein ruhiges und ehrliches Gespräch brauchen, daher höre aufmerksam zu und vermeide scharfe Reaktionen. Die kommenden Tage sind außerdem günstig, um gemeinsame kleine Freuden zu genießen. Zeit mit Freunden und Familie schenkt dir positive Energie — eine ideale Phase für Entspannung und fröhliche Treffen.",
      "virgo": "Jungfrau, jetzt ist ein guter Zeitpunkt, um auf deine eigenen Bedürfnisse zu hören und zu überlegen, welche Angelegenheiten wirklich deine Aufmerksamkeit verdienen. Das hilft dir, Stress besser zu kontrollieren und Entscheidungen im Einklang mit dir selbst zu treffen. In finanziellen Fragen ist Vorsicht geboten, da unüberlegte Schritte später zu größeren Problemen führen können. Gegen Ende des Monats kannst du mit einer spannenden Nachricht rechnen, die deine Zukunft deutlich beeinflussen könnte.",
      "libra": "Waage, dein Kopf ist derzeit voller Ideen, daher ist es sinnvoll, dir ein konkretes Ziel zu setzen und dich konsequent auf dessen Umsetzung zu konzentrieren. So erzielst du die besten Ergebnisse und empfindest Zufriedenheit über gut erledigte Aufgaben. Gegen Ende des Monats erwartet dich eine angenehme Überraschung, die dir viel Freude und positive Gefühle bereiten wird.",
      "scorpio": "Skorpion, denke daran, dass nicht jede Diskussion oder jeder Streit deine Energie wert ist. Bewahre deine Kraft für Dinge, die wirklich von Bedeutung sind. Jetzt ist auch ein guter Moment, um alte Kapitel abzuschließen und vergangene Verletzungen loszulassen. Hab keine Angst vor diesen Entscheidungen, selbst wenn sie bei anderen starke Gefühle auslösen — im Moment ist es wichtig, für dich selbst einzustehen.",
      "sagittarius": "Schütze, die kommende Woche bietet dir die Gelegenheit, dein Leben aus einer neuen Perspektive zu betrachten. Nicht alle Informationen, die dich erreichen, sind verlässlich, daher solltest du vorsichtig in deinen Kontakten sein und nicht alle Pläne preisgeben. Zum Jahreswechsel von Dezember zu Januar erwarten dich erfreuliche Überraschungen in Liebesangelegenheiten und persönlichen Beziehungen.",
      "capricorn": "Steinbock, bei der Arbeit könnte dir ein Kooperationsangebot oder ein Projekt begegnen, das ein kreatives Herangehen erfordert. Es ist ratsam, alle Optionen gründlich zu prüfen, bevor du eine Entscheidung triffst. In privaten Beziehungen wird Ehrlichkeit dein Verbündeter sein — Missverständnisse können aus Unklarheiten entstehen, daher bemühe dich um klare und offene Kommunikation. Gönn dir auch eine Auszeit, du brauchst sie wirklich.",
      "aquarius": "Wassermann, die kommende Woche schenkt dir viel Energie und den Mut, Veränderungen im privaten und beruflichen Leben anzugehen. Es könnte sich eine Gelegenheit zur Zusammenarbeit mit jemandem ergeben, der neue Perspektiven einbringt. Es lohnt sich, neue Herausforderungen anzunehmen, denn sie können zu greifbaren Erfolgen führen. Auch wenn der Wochenanfang etwas chaotisch sein könnte, wirst du schnell wieder ins Gleichgewicht kommen, wenn du ruhig und methodisch vorgehst.",
      "pisces": "Fische, jemand aus deinem Umfeld könnte versuchen, deine Pläne zu beeinflussen, doch es ist wichtig, deiner eigenen Vision treu zu bleiben. Denke daran, dass du nicht um jeden Preis nachgeben musst. Emotional erwartet dich eine Phase gewisser Instabilität, also höre auf dich selbst und deine Bedürfnisse. Verzichte nicht auf Gelegenheiten zu Vergnügen und Treffen mit Menschen, die dir wichtig sind — diese Zeit kann Freude bringen und Beziehungen stärken."
    }
  }
}
