{
  "26.01.2026-01.02.2026": {
    "pl": {
      "aries": "Baranie, końcówka stycznia sprzyja domykaniu spraw, które od dawna czekały na Twoją uwagę. Zamiast działać w pośpiechu, postaw na dokładność i rozwagę – to teraz przyniesie najlepsze efekty. Twoje samopoczucie zacznie się poprawiać, jeśli znajdziesz czas na wyciszenie i odpoczynek. Ogranicz nadmiar bodźców, słuchaj wewnętrznego głosu, a weekend przeznacz na prawdziwy reset i odzyskanie energii.",
      "taurus": "Byku, w tym tygodniu wsłuchuj się uważnie w potrzeby swojego ciała. Jeśli coś Cię niepokoi, nie odkładaj konsultacji ze specjalistą – profilaktyka ma teraz ogromne znaczenie. Zadbaj również o relacje z bliskimi i wygospodaruj dla nich czas. Ich obecność i wsparcie będą Ci szczególnie potrzebne po ostatnich wydarzeniach w Twoim życiu.",
      "gemini": "Bliźniaku, najbliższy tydzień może przynieść poczucie niepewności. W sprawach finansowych postaw na ostrożność i proste rozwiązania, rezygnując z pochopnych zakupów. Twoje ciało daje znać, że tempo, które narzucasz sobie na co dzień, jest zbyt intensywne, dlatego warto na chwilę zwolnić i wsłuchać się w swoje potrzeby. Nawet krótka przerwa pomoże uporządkować myśli. W sferze uczuć możliwe są drobne napięcia, dlatego zachowaj spokój i podejmuj decyzje rozważnie.",
      "cancer": "Raku, w nadchodzącym tygodniu możesz wyraźniej odczuwać potrzebę odpoczynku oraz mniejszą motywację do codziennych obowiązków. To sygnał, że warto zwolnić i dać sobie czas na regenerację. Zanim nadejdzie weekend, zatroszcz się o zdrowie i rozważ wykonanie badań kontrolnych, zwłaszcza jeśli dawno ich nie robiłeś lub czujesz się osłabiony. W sprawach serca osoby samotne mogą spotkać kogoś wyjątkowego, kto wniesie nową jakość do ich przyszłości.",
      "leo": "Lwie, ten tydzień zapowiada się w spokojnej i przyjaznej atmosferze. Uda Ci się uporządkować sprawy rodzinne, pod warunkiem że unikniesz napięć i postawisz na szczerość w rozmowach. Gwiazdy będą Ci sprzyjać w różnych obszarach życia, dodając odwagi do podejmowania decyzji. Zrozumiesz, że czasem warto podjąć ryzyko i nie rezygnować z marzeń. Jeśli zachowasz rozwagę i otwartość serca, wszystko ułoży się po Twojej myśli.",
      "virgo": "Panno, w nadchodzącym tygodniu skierujesz uwagę ku refleksji i trosce o własne emocje, co pomoże Ci odzyskać spokój i wewnętrzną harmonię. W sferze zawodowej zwróć szczególną uwagę na detale i staranność. W relacjach otwartość oraz empatyczne podejście pozwolą wzmocnić więzi z bliskimi. Końcówkę tygodnia przeznacz na odpoczynek i regenerację, by z nową energią zmierzyć się z kolejnymi wyzwaniami.",
      "libra": "Wago, nadchodzący tydzień może wydawać się dość jednostajny, jeśli nie wprowadzisz zmian swoimi decyzjami i działaniami. Dobre planowanie pomoże Ci uniknąć stresu związanego z brakiem czasu, dlatego nie zostawiaj spraw na ostatnią chwilę. Śmiało przedstawiaj swoje pomysły innym, bądź otwarta na konstruktywną krytykę, a wkrótce pojawią się przed Tobą nowe możliwości i droga do sukcesu.",
      "scorpio": "Skorpionie, ten tydzień może okazać się naprawdę udany, pod warunkiem że sam nie pokrzyżujesz planów pochopnymi decyzjami. Uda Ci się znaleźć czas na odpoczynek i domknąć kilka zawodowych spraw, które od dawna czekały na realizację. Pozwól sobie robić to, na co masz ochotę, i zadbaj o regenerację. Nie zapominaj też o profilaktyce – lepiej działać zapobiegawczo niż później zmagać się z chorobą. Wzmocnij odporność, odpoczywaj więcej, bo organizm może być podatny na przeziębienie.",
      "sagittarius": "Strzelcu, w nadchodzącym tygodniu Twoją największą siłą okaże się otwartość. Gdy poczujesz zamęt, warto uporządkować sprawy według ważności i skupić się na tym, co naprawdę istotne. Końcówka stycznia sprzyja nauce, poszerzaniu wiedzy i zdobywaniu nowych informacji. W sferze uczuciowej mogą Cię czekać przyjemne niespodzianki. W relacjach pamiętaj jednak, że sama rozmowność nie zawsze oznacza emocjonalną bliskość – postaraj się być uważny na potrzeby innych.",
      "capricorn": "Koziorożcu, nadchodzący tydzień będzie nieco inny niż zwykle. Poczujesz większą potrzebę spokoju i stabilności. W pracy warto skoncentrować się na konkretnych zadaniach, które przyniosą wyraźne rezultaty – zostaną one docenione przez przełożonych. W relacjach bliscy będą wdzięczni za Twoją cierpliwość i wsparcie. Pod koniec tygodnia znajdź chwilę na odpoczynek i regenerację sił.",
      "aquarius": "Wodniku, w ostatnim tygodniu stycznia możesz natrafić na coś nowego w swojej codziennej rutynie, co doda Ci energii i świeżości. Bądź jednak uważny, bo łatwo coś przeoczyć. W sferze miłości czeka Cię pomyślność, a Twoje życie uczuciowe może wkrótce przeżyć ekscytujące zmiany. Jest szansa, że spotkasz kogoś wyjątkowego, kto wprowadzi do Twojego życia radość i ciepło.",
      "pisces": "Rybo, w nadchodzącym tygodniu zwróć szczególną uwagę na sprawy rodzinne. W pracy zachowaj ostrożność wobec chaosu – zmiany w grafiku, niejasne ustalenia czy błędne informacje mogą Cię wytrącić z równowagi. Postaraj się znaleźć harmonię w codziennym życiu, bo to znacznie poprawi Twój komfort. Pod koniec tygodnia wygospodaruj czas dla siebie – spokojny wieczór lub kontakt z naturą pomoże Ci odzyskać równowagę."
    },
    "en": {
      "aries": "Aries, the end of January is a great time to finally close matters you’ve been putting off for a while. Focus on accuracy rather than rushing, as careful actions will bring better results now. Your well-being will gradually improve if you allow yourself moments of calm and rest. Avoid overstimulation, trust your intuition, and let the weekend be a time of genuine relaxation and recovery.",
      "taurus": "Taurus, this week pay close attention to the signals your body is sending you. If something feels off, don’t postpone seeing a doctor – prevention is especially important now. Make sure to spend some time with your loved ones as well. Their presence and support will be very valuable to you, especially after recent events in your life.",
      "gemini": "Gemini, the coming week may feel uncertain. In financial matters, choose caution and simplicity, and avoid impulsive spending. Your body is reacting to the pace you’ve set for yourself, so it’s a good idea to slow down and listen to what you truly need. Even a short break will help restore mental clarity. In love, some challenges may arise, so stay calm and act thoughtfully.",
      "cancer": "Cancer, in the coming week you may feel a stronger need for rest and a noticeable reluctance toward daily duties. This is a good moment to slow down and allow yourself some recovery. Before the weekend, take care of your health and consider routine check-ups, especially if it’s been a while or you haven’t been feeling your best. In matters of the heart, singles have a chance to meet someone special who could influence their future.",
      "leo": "Leo, this week will pass in a calm and positive atmosphere. You’ll be able to resolve certain family matters, as long as you avoid conflicts and focus on honest communication. The stars are on your side in many areas of life, encouraging you to act with confidence. You’ll realize that taking a risk can be worthwhile and that dreams are not meant to be abandoned. With a thoughtful approach and an open heart, things will go exactly as you hope.",
      "virgo": "Virgo, in the coming week you’ll be more inclined toward reflection and caring for your emotional well-being, which will help you regain inner balance. At work, it’s worth paying closer attention to precision and details. In relationships, honesty and empathy will allow you to deepen bonds with those close to you. Toward the end of the week, make time for rest and recovery to recharge for upcoming challenges.",
      "libra": "Libra, the coming week may feel rather monotonous unless you change it through your actions and choices. Careful planning will help you avoid stress and time pressure, so don’t leave everything until the last minute. Share your ideas confidently, stay open to feedback, and soon new opportunities and paths to success will open up for you.",
      "scorpio": "Scorpio, this week can turn out very positive, as long as you don’t disrupt it with impulsive decisions. You’ll manage to rest and successfully close several professional matters that have been waiting for completion for some time. Allow yourself to do what you enjoy and focus on relaxation. Remember that prevention is better than cure – support your immunity, get plenty of rest, as you may be more prone to catching a cold.",
      "sagittarius": "Sagittarius, openness will be your greatest asset this week. If you feel overwhelmed, take a moment to organize your priorities and focus on what truly matters. The final week of January supports learning and gaining new knowledge. In love, pleasant surprises may appear. In relationships, be aware that being talkative doesn’t always equal emotional presence – try to stay attentive to others’ feelings.",
      "capricorn": "Capricorn, the upcoming week will be a bit different from usual. You’ll feel a stronger need for calm and stability. At work, focus on specific tasks that will bring visible results – they will be appreciated by your superiors. In relationships, your patience and support will be valued by those close to you. Toward the end of the week, make time for rest and recovery.",
      "aquarius": "Aquarius, in the last week of January you may discover something new in your daily routine that brings energy and freshness. Stay alert, as it’s easy to overlook things. Love life looks promising, and exciting changes may soon take place. There is a chance you will meet someone special who brings joy and warmth into your life.",
      "pisces": "Pisces, this week focus on family matters. Be cautious at work, as schedule changes, unclear arrangements, or incorrect information could unsettle you. Try to find harmony in your daily routine, as it will make life feel much smoother. Toward the end of the week, take some time for yourself – a quiet evening or spending time in nature will help restore your balance."
    },
    "de": {
      "aries": "Widder, das Ende des Januars ist ein idealer Moment, um lange aufgeschobene Angelegenheiten abzuschließen. Setze dabei lieber auf Sorgfalt als auf Eile, denn achtsames Handeln zahlt sich jetzt aus. Dein Wohlbefinden wird sich nach und nach verbessern, wenn du dir Raum für Ruhe und Erholung gibst. Vermeide zu viele Reize, vertraue deiner Intuition und nutze das Wochenende für echte Entspannung und Regeneration.",
      "taurus": "Stier, höre in dieser Woche aufmerksam auf die Signale deines Körpers. Wenn du dich nicht ganz wohlfühlst, schiebe einen Arztbesuch nicht auf – Vorsorge ist jetzt besonders wichtig. Nimm dir außerdem Zeit für deine Liebsten. Ihre Nähe und Unterstützung wirst du nach den jüngsten Ereignissen in deinem Leben besonders brauchen.",
      "gemini": "Zwillinge, die kommende Woche kann von Unsicherheit geprägt sein. In finanziellen Angelegenheiten setze auf Vorsicht und einfache Lösungen und meide impulsive Ausgaben. Dein Körper reagiert auf das Tempo, das du dir selbst auferlegst, deshalb lohnt es sich, kurz innezuhalten und auf deine wirklichen Bedürfnisse zu hören. Schon eine kurze Pause bringt geistige Klarheit zurück. In der Liebe könnten kleinere Schwierigkeiten auftreten, daher bleib ruhig und handle überlegt.",
      "cancer": "Krebs, in der kommenden Woche könntest du ein stärkeres Bedürfnis nach Ruhe und eine deutlich geringere Lust auf Pflichten verspüren. Das ist ein gutes Zeichen, um das Tempo zu drosseln und dir Zeit zur Regeneration zu gönnen. Kümmere dich vor dem Wochenende um deine Gesundheit und denke über Vorsorgeuntersuchungen nach, besonders wenn diese lange zurückliegen oder du dich nicht ganz fit fühlst. In Herzensangelegenheiten haben Singles die Chance, jemand Besonderen kennenzulernen, der ihre Zukunft verändern könnte.",
      "leo": "Löwe, diese Woche wird in einer angenehmen und harmonischen Stimmung verlaufen. Es gelingt dir, einige familiäre Angelegenheiten zu klären, sofern du Konflikte meidest und auf ehrliche Gespräche setzt. Die Sterne stehen in vielen Lebensbereichen auf deiner Seite und schenken dir Mut für Entscheidungen. Du wirst erkennen, dass es sich manchmal lohnt, Risiken einzugehen und Träume nicht aufzugeben. Mit Besonnenheit und einem offenen Herzen wird sich alles zu deinen Gunsten entwickeln.",
      "virgo": "Jungfrau, in der kommenden Woche wirst du dich stärker auf Reflexion und den achtsamen Umgang mit deinen Emotionen konzentrieren, was dir hilft, innere Balance zurückzugewinnen. Im Beruf lohnt es sich, besonders auf Genauigkeit und Details zu achten. In Beziehungen fördern Ehrlichkeit und Empathie eine tiefere Verbindung zu deinen Liebsten. Nutze das Ende der Woche für Erholung und Regeneration, um neue Kraft für kommende Herausforderungen zu sammeln.",
      "libra": "Waage, die kommende Woche könnte recht eintönig wirken, wenn du sie nicht durch deine Entscheidungen und dein Handeln aktiv gestaltest. Eine gute Planung hilft dir, Zeitdruck und Stress zu vermeiden, deshalb verschiebe Aufgaben nicht bis zur letzten Minute. Überzeuge andere von deinen Ideen, sei offen für konstruktive Kritik, und schon bald eröffnen sich für dich neue Chancen und Wege zum Erfolg.",
      "scorpio": "Skorpion, diese Woche kann für dich sehr erfolgreich sein, sofern du sie nicht durch unüberlegte Entscheidungen selbst sabotierst. Du wirst Zeit zur Erholung finden und mehrere berufliche Angelegenheiten abschließen, die schon lange auf ihre Umsetzung gewartet haben. Erlaube dir, das zu tun, worauf du Lust hast, und achte auf ausreichende Entspannung. Denke auch an Vorsorge – Vorbeugen ist besser als Heilen. Stärke dein Immunsystem und gönn dir viel Ruhe, da du anfälliger für eine Erkältung sein könntest.",
      "sagittarius": "Schütze, in dieser Woche wird Offenheit zu deiner größten Stärke. Wenn du inneres Chaos spürst, bring deine Prioritäten in Ordnung und konzentriere dich auf das Wesentliche. Die letzte Januarwoche begünstigt Lernen und das Sammeln neuer Informationen. In der Liebe könnten angenehme Überraschungen auf dich warten. In Beziehungen sei dir jedoch bewusst, dass Redseligkeit nicht immer mit emotionaler Nähe einhergeht – achte darauf, wirklich präsent zu sein.",
      "capricorn": "Steinbock, die kommende Woche wird etwas anders als sonst verlaufen. Du wirst ein stärkeres Bedürfnis nach Ruhe und Stabilität verspüren. Konzentriere dich bei der Arbeit auf konkrete Aufgaben, die sichtbare Ergebnisse bringen – diese werden von den Vorgesetzten geschätzt. In Beziehungen werden deine Geduld und Unterstützung von deinen Liebsten anerkannt. Am Ende der Woche solltest du dir Zeit für Erholung und Regeneration nehmen.",
      "aquarius": "Wassermann, in der letzten Januarwoche könntest du etwas Neues in deiner täglichen Routine entdecken, das dir Energie und Frische gibt. Sei jedoch aufmerksam, denn es ist leicht, etwas zu übersehen. In der Liebe stehen die Sterne gut, und bald könnten aufregende Veränderungen in deinem Liebesleben eintreten. Es besteht die Chance, dass du jemanden Besonderen triffst, der Freude und Wärme in dein Leben bringt.",
      "pisces": "Fische, in dieser Woche solltest du dich auf familiäre Angelegenheiten konzentrieren. Sei bei der Arbeit vorsichtig, denn Änderungen im Zeitplan, unklare Absprachen oder falsche Informationen könnten dich aus dem Gleichgewicht bringen. Versuche, Harmonie im Alltag zu finden, da dies dein Wohlbefinden deutlich verbessert. Am Ende der Woche nimm dir etwas Zeit für dich selbst – ein ruhiger Abend oder Zeit in der Natur hilft, das Gleichgewicht wiederzufinden."
    }
  }
}
