{
  "22.12.2025-28.12.2025": {
    "en": {
      "aries": "Aries, this week may bring positive financial changes, especially if you take the time to analyze your budget and make thoughtful decisions. Close relationships will appreciate your attention, and conversations with them will strengthen bonds and bring satisfaction. Remember to always find a balance between work and personal life. No extremes are good.",
      "taurus": "Taurus, it's worth taking care of regular rest and making small changes in your diet to improve your well-being. A short workout or walk will help you relieve stress, but remember not to overburden your body; balance is key now. Also, think about preventive tests, remember the rule: prevention is better than cure!",
      "gemini": "Gemini, focus and consistency will help you feel relief and regain control over your responsibilities. It's also worth finding time to relax. A short walk or a moment with your favorite book will help you gather your thoughts and recharge. Sometimes you'll feel like reminiscing - allow yourself that. Think about closing some doors from the past to be able to look forward to the future with joy.",
      "cancer": "Cancer, meetings with inspiring people can stimulate your mind and give you the courage to take on new challenges. Listen to your intuition, especially in personal matters, your inner wisdom will help you make the right decisions. Don't forget about your health, don't ignore the symptoms your body sends.",
      "leo": "Leo, this is an excellent time to listen to your own intuition and notice signals that may lead you towards new development opportunities. Take care of your psychological comfort and emotions, don't let the pressure of others take away your peace. Also consider helping others or small charitable actions that can bring you satisfaction and joy.",
      "virgo": "Virgo, the upcoming week is conducive to reflection and quiet. This is a good time to listen to yourself and your needs, both emotional and physical. Moments of solitude will help you organize your thoughts and gain distance from daily matters. In personal relationships, it's worth focusing on honesty and openness; conversations that previously seemed difficult will now bring relief and understanding. Don't avoid contact with loved ones, as small gestures bring people closer than words.",
      "libra": "Libra, this week you can expect pleasant surprises. Friends and loved ones will appreciate your presence, and warm words will boost your self-confidence. Appreciate small gestures, as they will have the greatest value this week. Also, don't forget to take care of your body and mind. A light walk, a moment of meditation, or a short rest will help you regain harmony and maintain a balance between responsibilities and regeneration.",
      "scorpio": "Scorpio, the upcoming week will bring you many positive vibrations and moments that will stimulate your creativity. Meetings and conversations with loved ones can spark enthusiasm in you, and it's worth using this energy to take action in your work and personal life. In emotional relationships, you will feel more confident, which will allow you to finally address topics that you have been postponing.",
      "sagittarius": "Sagittarius, the coming days will bring you many joyful moments and positive emotions. Your sense of humor will be contagious, so your surroundings will happily spend time in your company. At work, you can expect quick results of your actions if you maintain focus and patience. Also, remember your health; small signs of fatigue should not be ignored.",
      "capricorn": "Capricorn, the coming week will favor the pursuit of harmony and balance in life, both private and professional. Some days may bring minor tensions, but over time the atmosphere will become calmer, and you will feel a surge of positive energy. At work, productive days await you; your patience and accuracy will be noticed and appreciated. Don't forget to rest; you need to take care of your health.",
      "aquarius": "Aquarius, the week looks promising financially; there may be favorable offers or unexpected opportunities. However, remember to make decisions carefully and not be guided by impulse. It's also worth consulting your investment plans with someone trustworthy, which will help avoid mistakes. In private relationships, take a moment to talk to loved ones; support and honesty will help build a sense of security.",
      "pisces": "Pisces, the coming week will bring an opportunity to demonstrate intuition, both at work and in everyday situations. Although it's worth trusting your instincts, don't forget the facts. A healthy balance between heart and mind will help you avoid unnecessary conflicts and misunderstandings."
    },
    "pl": {
      "aries": "W tym tygodniu, Baranie, możesz doświadczyć pozytywnych zmian finansowych, zwłaszcza jeśli poświęcisz czas na analizę budżetu i przemyślane decyzje. Osoby bliskie docenią Twoją uwagę, a rozmowy z nimi wzmocnią więzi i przyniosą satysfakcję. Pamiętaj o równowadze między pracą a życiem prywatnym. Żadna skrajność nie jest korzystna.",
      "taurus": "Byku, warto zadbać o regularny odpoczynek oraz wprowadzić drobne zmiany w diecie, które poprawią Twoje samopoczucie. Krótki trening lub spacer pozwolą Ci rozładować napięcie, ale pamiętaj, by nie przeciążać organizmu, balans jest teraz kluczem. Pomyśl też o badaniach profilaktycznych, pamiętaj o zasadzie: lepiej zapobiegać, niż leczyć!",
      "gemini": "Bliźniaku, skupienie i systematyczność pozwolą Ci poczuć ulgę i odzyskać kontrolę nad obowiązkami. Warto też znaleźć czas na odpoczynek. Krótki spacer czy chwila z ulubioną książką pozwolą Ci zebrać myśli i naładować baterie. Chwilami najdzie Cię ochota na wspomnienia - pozwól sobie na nie. Pomyśl o zamknięciu za sobą jakichś drzwi z przeszłości, by móc radośnie spojrzeć w przyszłość.",
      "cancer": "Raku, spotkania z inspirującymi osobami mogą pobudzić Twój umysł i dodać odwagi do podejmowania nowych wyzwań. Wsłuchaj się w intuicję, zwłaszcza w sprawach osobistych, Twoja wewnętrzna mądrość pomoże Ci podjąć właściwe decyzje. Nie zapominaj o swoim zdrowiu, nie ignoruj objawów, które wysyła Twój organizm.",
      "leo": "Lwie, to doskonały czas, by wsłuchać się w własną intuicję i zauważyć sygnały, które mogą prowadzić Cię w stronę nowych możliwości rozwoju. Zadbaj o komfort psychiczny i swoje emocje, nie pozwól, by presja innych odbierała Ci spokój. Rozważ również pomoc innym lub drobne działania charytatywne, które mogą przynieść Ci satysfakcję i radość.",
      "virgo": "Panno, nadchodzący tydzień sprzyja refleksji i wyciszeniu. To dobry moment, by wsłuchać się w siebie i swoje potrzeby, zarówno emocjonalne, jak i fizyczne. Chwile samotności pozwolą uporządkować myśli i nabrać dystansu do codziennych spraw. W relacjach osobistych warto postawić na szczerość i otwartość, rozmowy, które wcześniej wydawały się trudne, teraz przyniosą ulgę i zrozumienie. Nie unikaj kontaktu z bliskimi, bo drobne gesty zbliżają bardziej niż słowa.",
      "libra": "Wago, w tym tygodniu możesz liczyć na miłe niespodzianki. Przyjaciele i bliscy docenią Twoją obecność, a ciepłe słowa wzmocnią Twoją pewność siebie. Doceniaj małe gesty, to one w tym tygodniu będą miały największą wartość. Nie zapominaj też o dbaniu o swoje ciało i umysł. Lekki spacer, chwila medytacji lub krótki odpoczynek pozwolą Ci odzyskać harmonię i utrzymać balans między obowiązkami a regeneracją.",
      "scorpio": "Skorpionie, nadchodzący tydzień przyniesie Ci wiele pozytywnych wibracji i chwil, które pobudzą Twoją kreatywność. Spotkania i rozmowy z bliskimi mogą wywołać w Tobie iskrę entuzjazmu, warto wykorzystać tę energię do działania w pracy i życiu osobistym. W relacjach uczuciowych poczujesz większą pewność siebie, co pozwoli Ci w końcu poruszyć tematy, które do tej pory odkładałeś.",
      "sagittarius": "Strzelcu, nadchodzące dni przyniosą Ci wiele radosnych chwil i pozytywnych emocji. Twoje poczucie humoru będzie zaraźliwe, dzięki czemu otoczenie chętnie spędzi czas w Twoim towarzystwie. W pracy możesz liczyć na szybkie efekty działań, jeśli zachowasz skupienie i cierpliwość. Pamiętaj też o zdrowiu, drobne oznaki przemęczenia nie powinny być ignorowane.",
      "capricorn": "Koziorożcu, najbliższy tydzień będzie sprzyjał poszukiwaniu harmonii i równowagi w życiu, zarówno prywatnym, jak i zawodowym. Niektóre dni mogą przynieść drobne napięcia, ale z czasem atmosfera stanie się spokojniejsza, a Ty poczujesz przypływ pozytywnej energii. W pracy czekają Cię produktywne dni, Twoja cierpliwość i dokładność zostaną zauważone i docenione. Nie zapominaj o odpoczynku, musisz zadbać o swoje zdrowie.",
      "aquarius": "Wodniku, finansowo tydzień zapowiada się obiecująco, mogą pojawić się korzystne propozycje lub niespodziewane okazje. Pamiętaj jednak, aby podejmować decyzje rozważnie i nie kierować się impulsem. Warto także skonsultować plany inwestycyjne z kimś zaufanym, co pozwoli uniknąć błędów. W relacjach prywatnych poświęć chwilę na rozmowę z bliskimi, wsparcie i szczerość pomogą zbudować poczucie bezpieczeństwa.",
      "pisces": "Rybo, nadchodzący tydzień przyniesie okazję do wykazania się intuicją, zarówno w pracy, jak i w codziennych sytuacjach. Choć warto ufać przeczuciom, nie zapominaj o faktach. Zdrowy balans między sercem a rozumem pozwoli Ci uniknąć niepotrzebnych konfliktów i nieporozumień."
    },
    "de": {
      "aries": "Widder, diese Woche könnte positive finanzielle Veränderungen bringen, besonders wenn Sie Zeit für die Analyse Ihres Budgets und überlegte Entscheidungen nehmen. Nahe stehende Personen werden Ihre Aufmerksamkeit zu schätzen wissen, und Gespräche mit ihnen werden die Bindungen stärken und Zufriedenheit bringen. Denken Sie daran, immer ein Gleichgewicht zwischen Arbeit und Privatleben zu finden. Keine Extremitäten sind gut.",
      "taurus": "Stier, es lohnt sich, auf regelmäßige Erholung zu achten und kleine Änderungen in Ihrer Ernährung vorzunehmen, die Ihr Wohlbefinden verbessern. Eine kurze Trainingseinheit oder ein Spaziergang helfen Ihnen, Stress abzubauen, aber denken Sie daran, Ihren Körper nicht zu überlasten; Balance ist jetzt entscheidend. Denken Sie auch an Vorsorgeuntersuchungen, erinnern Sie sich an das Prinzip: Vorbeugen ist besser als Heilen!",
      "gemini": "Zwilling, Konzentration und Systematik werden Ihnen helfen, Erleichterung zu verspüren und die Kontrolle über Ihre Verpflichtungen zurückzugewinnen. Es lohnt sich auch, Zeit für Entspannung zu finden. Ein kurzer Spaziergang oder ein Moment mit Ihrem Lieblingsbuch helfen Ihnen, Ihre Gedanken zu sammeln und Ihre Batterien aufzuladen. Manchmal werden Sie Lust auf Erinnerungen haben - erlauben Sie sich das. Denken Sie daran, einige Türen aus der Vergangenheit zu schließen, um freudig in die Zukunft blicken zu können.",
      "cancer": "Krebs, Begegnungen mit inspirierenden Menschen können Ihren Geist anregen und Ihnen den Mut geben, neue Herausforderungen anzunehmen. Hören Sie auf Ihre Intuition, besonders in persönlichen Angelegenheiten, Ihre innere Weisheit wird Ihnen helfen, die richtigen Entscheidungen zu treffen. Vergessen Sie nicht Ihre Gesundheit, ignorieren Sie nicht die Symptome, die Ihr Körper Ihnen sendet.",
      "leo": "Löwe, dies ist eine ausgezeichnete Zeit, um auf Ihre eigene Intuition zu hören und Signale zu bemerken, die Sie zu neuen Entwicklungsmöglichkeiten führen können. Sorge für psychisches Wohlbefinden und deine Emotionen, lass nicht zu, dass der Druck anderer dir deinen Frieden nimmt. Überlege auch, anderen zu helfen oder kleine wohltätige Aktionen zu unternehmen, die dir Zufriedenheit und Freude bringen können.",
      "virgo": "Jungfrau, die kommende Woche fördert Reflexion und Stille. Dies ist eine gute Zeit, um auf sich selbst und Ihre Bedürfnisse, sowohl emotional als auch körperlich, zu hören. Augenblicke der Einsamkeit helfen Ihnen, Ihre Gedanken zu ordnen und Abstand zu den Alltagsangelegenheiten zu gewinnen. In persönlichen Beziehungen ist es wert, auf Ehrlichkeit und Offenheit zu setzen; Gespräche, die zuvor schwierig schienen, werden nun Erleichterung und Verständnis bringen. Vermeiden Sie den Kontakt mit Ihren Lieben nicht, denn kleine Gesten bringen Menschen näher als Worte.",
      "libra": "Waage, in dieser Woche können Sie mit angenehmen Überraschungen rechnen. Freunde und Angehörige werden Ihre Anwesenheit schätzen, und warme Worte werden Ihr Selbstvertrauen stärken. Schätzen Sie kleine Gesten, denn sie werden in dieser Woche den größten Wert haben. Vergessen Sie auch nicht, auf Ihren Körper und Geist zu achten. Ein leichter Spaziergang, ein Moment der Meditation oder eine kurze Pause helfen Ihnen, Harmonie wiederzuerlangen und ein Gleichgewicht zwischen Verpflichtungen und Regeneration zu halten.",
      "scorpio": "Skorpion, die kommende Woche wird Ihnen viele positive Schwingungen und Momente bringen, die Ihre Kreativität anregen. Begegnungen und Gespräche mit Lieben können in Ihnen einen Funken Enthusiasmus entfachen, und es lohnt sich, diese Energie für Handlungen in Arbeit und Privatleben zu nutzen. In emotionalen Beziehungen werden Sie mehr Selbstvertrauen spüren, was Ihnen erlaubt, endlich Themen anzusprechen, die Sie bisher aufgeschoben haben.",
      "sagittarius": "Schütze, die kommenden Tage werden Ihnen viele fröhliche Momente und positive Emotionen bringen. Ihr Humor wird ansteckend sein, sodass Ihre Umgebung gerne Zeit in Ihrer Gesellschaft verbringt. Bei der Arbeit können Sie mit schnellen Ergebnissen Ihrer Handlungen rechnen, wenn Sie Konzentration und Geduld bewahren. Denken Sie auch an Ihre Gesundheit; kleine Anzeichen von Müdigkeit sollten nicht ignoriert werden.",
      "capricorn": "Steinbock, die kommende Woche wird der Suche nach Harmonie und Ausgleich im Leben, sowohl privat als auch beruflich, förderlich sein. Manche Tage können kleine Spannungen bringen, aber mit der Zeit wird die Atmosphäre ruhiger, und Sie werden einen Anstieg positiver Energie spüren. Bei der Arbeit erwarten Sie produktive Tage; Ihre Geduld und Genauigkeit werden bemerkt und geschätzt werden. Vergessen Sie nicht, sich auszuruhen; Sie müssen sich um Ihre Gesundheit kümmern.",
      "aquarius": "Wassermann, finanziell verspricht die Woche vielversprechend zu sein; es könnten vorteilhafte Angebote oder unerwartete Gelegenheiten auftauchen. Denken Sie jedoch daran, Entscheidungen sorgfältig zu treffen und sich nicht von Impulsen leiten zu lassen. Es lohnt sich auch, Ihre Investitionspläne mit jemandem Vertrauenswürdigem zu besprechen, was Ihnen helfen wird, Fehler zu vermeiden. In privaten Beziehungen nehmen Sie sich einen Moment Zeit, um mit Ihren Lieben zu sprechen; Unterstützung und Ehrlichkeit helfen, ein Gefühl der Sicherheit aufzubauen.",
      "pisces": "Fische, die kommende Woche wird Ihnen die Gelegenheit bieten, Ihre Intuition zu zeigen, sowohl bei der Arbeit als auch in Alltagssituationen. Obwohl es sich lohnt, Ihren Instinkten zu vertrauen, vergessen Sie nicht die Fakten. Ein gesunder Ausgleich zwischen Herz und Verstand wird Ihnen helfen, unnötige Konflikte und Missverständnisse zu vermeiden."
    }
  },

  "08.04.2026-14.04.2026": {
    "en": {
      "aries": "",
      "taurus": "",
      "gemini": "",
      "cancer": "",
      "leo": "",
      "virgo": "",
      "libra": "",
      "scorpio": "",
      "sagittarius": "",
      "capricorn": "",
      "aquarius": "",
      "pisces": ""
    },
    "pl": {
      "aries": "",
      "taurus": "",
      "gemini": "",
      "cancer": "",
      "leo": "",
      "virgo": "",
      "libra": "",
      "scorpio": "",
      "sagittarius": "",
      "capricorn": "",
      "aquarius": "",
      "pisces": ""
    },
    "de": {
      "aries": "",
      "taurus": "",
      "gemini": "",
      "cancer": "",
      "leo": "",
      "virgo": "",
      "libra": "",
      "scorpio": "",
      "sagittarius": "",
      "capricorn": "",
      "aquarius": "",
      "pisces": ""
    }
  }
}
