{
  "05.01.2026-11.01.2026": {
    "en": {
      "aries": "Aries, the coming days will bring you a fresh boost of energy and motivation to take action. You may feel a strong urge to make changes — don’t be afraid of it and trust your intuition, as it will guide you in the right direction. Greater harmony can appear in your relationships if you allow yourself honesty and spontaneity. This is a good moment to set ambitious goals and take the first step toward achieving them.",
      "taurus": "Taurus, this week it’s worth focusing more on yourself, as December may have been overly overwhelming for you. Try to rebuild your sense of balance and stability. You may also feel the need to refine your plans and take care of your comfort — both emotional and material. In relationships, greater openness will appear if you allow yourself to speak honestly about your desires. This is a good time to take the first step toward long-term changes.",
      "gemini": "Gemini, the beginning of the year looks quite dynamic for you. New ideas and opportunities for conversations may arise, opening doors to interesting and developmental possibilities. In the first days of the week, you’ll feel a sense of lightness and motivation to act. Relationships will gain momentum, but try not to get distracted and focus on what truly matters to you. This is an ideal moment to start something that has been on your mind for a long time.",
      "cancer": "Cancer, in the first week of January you may feel the need to slow down and tune in to your emotions. This is a good time to organize domestic matters and create an environment that supports a sense of security. In relationships, you can count on the support of loved ones, but it’s also important to communicate your needs clearly. Reflect on your professional life — it might be worth considering a change of job.",
      "leo": "Leo, a highly creative week lies ahead of you, giving you the chance to showcase your talents and regain confidence in yourself. You may experience a sudden surge of inspiration that encourages you to start new projects or make bold decisions. In relationships, there will be more warmth and mutual attentiveness — both from you and toward you. This is a good moment to remember that your needs are just as important as the needs of others.",
      "virgo": "Virgo, the beginning of the year will bring you a sense of clarity and order in matters that previously seemed confusing or unclear. This is a favorable time for planning and setting priorities — your consistency will soon start to deliver visible results. In relationships, you may feel the need for greater stability, so it’s worth having honest conversations about your expectations. The energy of this week also supports taking care of your health and making small but beneficial changes to your daily habits.",
      "libra": "Libra, the beginning of the year will bring you a strong surge of energy, helping you finally move forward with an idea you’ve been postponing for a long time. Use this impulse wisely, but remember to keep your emotions in check and avoid pouring all your enthusiasm into it at once. Acting too quickly may create unnecessary tension in your relationships with loved ones. In the middle of the week, you might experience a bit of chaos, but don’t worry — everything will fall into place as planned. Instead of fighting or trying to resolve conflicts forcefully, slow down and allow yourself time to recharge.",
      "scorpio": "Scorpio, the beginning of the year will show you that your intuition is one of your greatest strengths. You’ll sense the moods of others with remarkable sensitivity, helping you avoid unnecessary tension. Someone around you may behave a bit mysteriously, but it’s best not to jump to conclusions and simply focus on your own matters. If you’re single, an opportunity to start a connection that may surprise you with its intensity lies ahead. Allow yourself to be guided by your emotions — the start of the year is perfect for that. Those in relationships will feel a renewed warmth and a desire for conversations that strengthen mutual trust.",
      "sagittarius": "Sagittarius, the beginning of the year will be especially favorable for you. You’ll devote a lot of time to rebuilding and strengthening relationships with loved ones. Certain conversations will help you view some matters with greater distance. You’ll realize that not every problem requires an immediate response and that sometimes it’s better to let go of what’s beyond your control. Over the weekend, you may discover a talent or interest that had previously remained in the background. Dedicate time and energy to it, as it may bring not only personal fulfillment but also financial benefits in the future.",
      "capricorn": "Capricorn, this week focus on taking care of yourself and your health. Toward the end of the year, your body was already signaling a need for rest, so now is the time to prioritize recovery and slow down your pace. Long walks, quiet moments with a book, or a home spa routine will help you regain balance. If possible, plan a short trip — even a weekend getaway can bring you peace and renewed energy.",
      "aquarius": "Aquarius, this week you will focus a lot on financial matters, which can have a significant impact on your life, especially if you take the time to analyze your budget and make thoughtful decisions. In relationships, your loved ones will appreciate your attention, and conversations with them will strengthen bonds and bring satisfaction. Remember to maintain a balance between work and personal life — extremes are never good. If you feel uncertain, trust your intuition, as it rarely lets you down.",
      "pisces": "Pisces, the upcoming period will be quite reflective for you. There may even be an unexpected return of someone from your past. A conversation with this person could bring comfort or important clarifications if you allow yourself to be open. You will likely feel the need to confide in someone close — don’t hesitate to do so. Support from trusted people, especially those who view situations more rationally, can be very helpful. The start of the year is a good time for making changes and exploring new directions in your life."
    },
    "pl": {
      "aries": "Baranie, nadchodzące dni przyniosą Ci nową dawkę energii i chęci do działania. Możesz poczuć silną potrzebę wprowadzania zmian — nie obawiaj się jej i zaufaj swojej intuicji, bo wskaże Ci właściwą drogę. W relacjach zapanuje większa równowaga, jeśli pozwolisz sobie na szczerość i naturalność. To dobry czas na stawianie ambitnych celów i wykonanie pierwszego kroku w stronę ich realizacji.",
      "taurus": "Byku, w tym tygodniu warto zwrócić większą uwagę na siebie, ponieważ grudzień mógł być dla Ciebie zbyt intensywny. Spróbuj odbudować poczucie równowagi i stabilności. Możesz również poczuć potrzebę dopracowania swoich planów oraz zadbania o komfort — zarówno emocjonalny, jak i materialny. W relacjach pojawi się więcej szczerości, jeśli pozwolisz sobie otwarcie mówić o swoich potrzebach. To dobry moment, by wykonać pierwszy krok w stronę długofalowych zmian.",
      "gemini": "Bliźniaku, początek roku zapowiada się dla Ciebie bardzo intensywnie. Pojawią się świeże pomysły oraz okazje do rozmów, które mogą otworzyć przed Tobą nowe, rozwojowe możliwości. W pierwszych dniach tygodnia poczujesz przypływ lekkości i energii do działania. Relacje przyspieszą, jednak warto zachować uważność i skupiać się na tym, co jest dla Ciebie naprawdę istotne. To doskonały czas, by rozpocząć coś, co od dawna kiełkowało w Twoich myślach.",
      "cancer": "Raku, w pierwszym tygodniu stycznia możesz odczuć potrzebę zwolnienia tempa i głębszego wsłuchania się w swoje emocje. To odpowiedni czas, aby uporządkować sprawy domowe i stworzyć wokół siebie atmosferę sprzyjającą poczuciu bezpieczeństwa. W relacjach możesz liczyć na wsparcie bliskich, jednak pamiętaj, by jasno wyrażać swoje potrzeby. Zastanów się również nad sprawami zawodowymi — być może nadszedł moment, by rozważyć zmianę pracy.",
      "leo": "Lwie, przed Tobą wyjątkowo twórczy tydzień, który pozwoli Ci zaprezentować swoje umiejętności i odzyskać wiarę we własne możliwości. Możesz doświadczyć nagłego przypływu inspiracji, zachęcającego do rozpoczynania nowych projektów lub podejmowania śmiałych decyzji. W relacjach pojawi się więcej ciepła i wzajemnej uważności — zarówno z Twojej strony, jak i ze strony innych. To dobry czas, by przypomnieć sobie, że Twoje potrzeby są tak samo ważne jak potrzeby osób wokół Ciebie.",
      "virgo": "Panno, początek roku przyniesie Ci poczucie jasności i uporządkowania spraw, które wcześniej mogły wydawać się chaotyczne lub niejasne. To sprzyjający czas na planowanie oraz ustalanie priorytetów — Twoja systematyczność szybko zacznie przynosić widoczne rezultaty. W relacjach możesz odczuć potrzebę większej stabilności, dlatego warto otwarcie porozmawiać o swoich oczekiwaniach. Energia tego tygodnia wspiera także troskę o zdrowie i wprowadzanie drobnych, ale korzystnych zmian w codziennych nawykach.",
      "libra": "Wago, początek roku przyniesie Ci silny przypływ energii, który pomoże ruszyć z pomysłem odkładanym od dłuższego czasu. Skorzystaj z tego impulsu, ale pamiętaj, by zachować umiar i kontrolować emocje, nie angażując całego swojego entuzjazmu naraz. Zbyt pochopne reakcje mogą wywołać niepotrzebne napięcia w relacjach z bliskimi. W połowie tygodnia możesz odczuć chwilowy chaos, jednak nie martw się — wszystko ułoży się zgodnie z planem. Zamiast walczyć i szukać rozwiązań konfliktów na siłę, zwolnij tempo i pozwól sobie na regenerację.",
      "scorpio": "Skorpionie, początek roku uświadomi Ci, że Twoja intuicja jest jednym z Twoich największych atutów. Z dużą wrażliwością będziesz wyczuwać nastroje innych, co pomoże Ci uniknąć zbędnych napięć. Ktoś z Twojego otoczenia może zachowywać się w tajemniczy sposób, jednak nie warto wyciągać pochopnych wniosków — najlepiej skupić się na własnych sprawach. Jeśli jesteś singlem lub singielką, przed Tobą szansa na znajomość, która zaskoczy Cię swoją intensywnością. Pozwól sobie na emocje — początek roku sprzyja takim doświadczeniom. Osoby w związkach poczują więcej ciepła i chęci do rozmów, które umacniają wzajemne zaufanie.",
      "sagittarius": "Strzelcu, początek roku będzie dla Ciebie wyjątkowo sprzyjający. Wiele uwagi poświęcisz odbudowie i umacnianiu relacji z bliskimi. Niektóre rozmowy pozwolą Ci spojrzeć na różne sprawy z większym dystansem. Zrozumiesz, że nie każdy problem wymaga natychmiastowej reakcji i czasem warto odpuścić to, na co nie masz wpływu. W weekend możesz odkryć w sobie talent lub pasję, które dotąd pozostawały na drugim planie. Warto poświęcić im czas i energię, ponieważ mogą przynieść nie tylko satysfakcję, ale również finansowe korzyści w przyszłości.",
      "capricorn": "Koziorożcu, w tym tygodniu szczególnie zadbaj o siebie i swoje zdrowie. Już pod koniec roku Twój organizm dawał sygnały, że potrzebuje odpoczynku, dlatego warto postawić na regenerację i wolniejsze tempo. Długie spacery, chwile z książką lub domowe rytuały relaksacyjne pomogą Ci odzyskać równowagę. Jeśli masz taką możliwość, zaplanuj krótki wyjazd — nawet weekend poza domem przyniesie Ci spokój i nową dawkę energii.",
      "aquarius": "Wodniku, w tym tygodniu poświęcisz sporo uwagi sprawom finansowym, które mogą znacząco wpłynąć na Twoje życie, zwłaszcza jeśli dokładnie przeanalizujesz budżet i podejmiesz przemyślane decyzje. W relacjach bliskie osoby docenią Twoją troskę, a rozmowy z nimi wzmocnią więzi i przyniosą satysfakcję. Pamiętaj, aby zachować równowagę między pracą a życiem prywatnym — skrajności nie są wskazane. Jeśli będziesz się wahać, zaufaj swojej intuicji, bo rzadko Cię zawodzi.",
      "pisces": "Rybo, nadchodzący czas będzie dla Ciebie bardziej refleksyjny. Może nawet pojawić się niespodziewany powrót kogoś z przeszłości. Rozmowa z tą osobą może przynieść Ci ukojenie lub istotne wyjaśnienia, jeśli otworzysz się na szczerość. Prawdopodobnie poczujesz potrzebę zwierzenia się komuś bliskiemu — nie wahaj się tego zrobić. Wsparcie osób, którym ufasz, a zwłaszcza tych patrzących na sprawy bardziej racjonalnie, może okazać się bardzo pomocne. Początek roku sprzyja wprowadzaniu zmian i nowych kierunków w życiu."
    },
    "de": {
      "aries": "Widder, die kommenden Tage bringen dir einen neuen Energieschub und viel Motivation zum Handeln. Du könntest ein starkes Bedürfnis verspüren, Veränderungen vorzunehmen — hab keine Angst davor und vertraue deiner Intuition, denn sie wird dich in die richtige Richtung führen. In Beziehungen kann mehr Harmonie entstehen, wenn du dir Ehrlichkeit und Spontaneität erlaubst. Jetzt ist ein guter Zeitpunkt, ehrgeizige Ziele zu setzen und den ersten Schritt zu ihrer Verwirklichung zu machen.",
      "taurus": "Stier, in dieser Woche solltest du dich stärker auf dich selbst konzentrieren, da der Dezember für dich sehr reizüberflutend gewesen sein könnte. Versuche, dein Gefühl von Stabilität und Ausgeglichenheit neu aufzubauen. Möglicherweise verspürst du auch das Bedürfnis, deine Pläne zu verfeinern und für mehr Komfort zu sorgen — sowohl emotional als auch materiell. In Beziehungen kann mehr Offenheit entstehen, wenn du über deine Wünsche sprichst. Jetzt ist ein guter Zeitpunkt, um den ersten Schritt in Richtung langfristiger Veränderungen zu machen.",
      "gemini": "Zwillinge, der Jahresanfang gestaltet sich für dich recht dynamisch. Neue Ideen und Gesprächsmöglichkeiten können sich ergeben und interessante, entwicklungsfördernde Türen öffnen. In den ersten Tagen der Woche wirst du einen Schub an Leichtigkeit und Tatendrang spüren. Beziehungen nehmen an Tempo zu, doch versuche, dich nicht zu verzetteln und dich auf das zu konzentrieren, was dir wirklich wichtig ist. Jetzt ist der ideale Zeitpunkt, um etwas zu beginnen, das dir schon lange im Kopf herumschwirrt.",
      "cancer": "Krebs, in der ersten Januarwoche könntest du das Bedürfnis verspüren, das Tempo zu drosseln und dich intensiver mit deinen Emotionen zu beschäftigen. Jetzt ist ein guter Moment, um häusliche Angelegenheiten zu ordnen und eine Atmosphäre zu schaffen, die Sicherheit vermittelt. In Beziehungen kannst du auf die Unterstützung deiner Liebsten zählen, solltest jedoch auch deine Bedürfnisse klar kommunizieren. Denke über deine berufliche Situation nach — vielleicht ist es an der Zeit, einen Jobwechsel in Betracht zu ziehen.",
      "leo": "Löwe, vor dir liegt eine besonders kreative Woche, in der du deine Talente zeigen und dein Selbstvertrauen stärken kannst. Ein plötzlicher Inspirationsschub könnte dich dazu ermutigen, neue Projekte zu beginnen oder mutige Entscheidungen zu treffen. In Beziehungen wird es mehr Wärme und gegenseitige Aufmerksamkeit geben — sowohl von dir als auch dir gegenüber. Jetzt ist ein guter Zeitpunkt, dir bewusst zu machen, dass deine Bedürfnisse genauso wichtig sind wie die der anderen.",
      "virgo": "Jungfrau, der Jahresbeginn bringt dir Klarheit und Ordnung in Angelegenheiten, die zuvor chaotisch oder schwer verständlich wirkten. Jetzt ist ein guter Zeitpunkt für Planung und Prioritätensetzung — deine Konsequenz wird bald sichtbare Ergebnisse liefern. In Beziehungen könntest du ein stärkeres Bedürfnis nach Stabilität verspüren, daher lohnt sich ein offenes Gespräch über deine Erwartungen. Die Energie dieser Woche begünstigt außerdem die Sorge um die Gesundheit und kleine, positive Veränderungen im Alltag.",
      "libra": "Waage, der Jahresbeginn bringt dir einen starken Energieschub, mit dem du endlich ein lange aufgeschobenes Vorhaben angehen kannst. Nutze diesen Impuls bewusst, achte jedoch darauf, deine Emotionen im Gleichgewicht zu halten und nicht deinen gesamten Enthusiasmus auf einmal einzusetzen. Zu schnelle Reaktionen könnten unnötige Spannungen in Beziehungen zu nahestehenden Menschen verursachen. Zur Wochenmitte kann etwas Chaos entstehen, doch keine Sorge — am Ende wird sich alles wie geplant fügen. Anstatt zu kämpfen oder Konflikte um jeden Preis lösen zu wollen, drossle das Tempo und gönn dir Zeit zur Erholung.",
      "scorpio": "Skorpion, der Jahresbeginn wird dir zeigen, dass deine Intuition eine deiner größten Stärken ist. Mit besonderer Feinfühligkeit wirst du die Stimmungen anderer wahrnehmen und so unnötige Spannungen vermeiden. Jemand in deinem Umfeld könnte sich etwas geheimnisvoll verhalten, doch ziehe keine vorschnellen Schlüsse und konzentriere dich lieber auf deine eigenen Angelegenheiten. Bist du Single, bietet sich dir die Chance auf eine Begegnung, die dich mit ihrer Intensität überraschen kann. Lass dich von deinen Gefühlen leiten — der Jahresanfang ist genau die richtige Zeit dafür. Menschen in festen Beziehungen spüren mehr Wärme und den Wunsch nach Gesprächen, die das gegenseitige Vertrauen stärken.",
      "sagittarius": "Schütze, der Jahresbeginn wird für dich besonders günstig verlaufen. Du wirst viel Zeit darauf verwenden, Beziehungen zu nahestehenden Menschen zu festigen und neu aufzubauen. Manche Gespräche ermöglichen dir einen distanzierteren Blick auf bestimmte Angelegenheiten. Du erkennst, dass nicht jedes Problem sofortiges Handeln erfordert und dass es manchmal besser ist, Dinge loszulassen, auf die du keinen Einfluss hast. Am Wochenende könntest du ein Talent oder Interesse entdecken, das bisher im Hintergrund geblieben ist. Widme ihm Zeit und Energie, denn es kann dir nicht nur Zufriedenheit, sondern in Zukunft auch finanzielle Vorteile bringen.",
      "capricorn": "Steinbock, in dieser Woche solltest du besonders auf dich und deine Gesundheit achten. Bereits zum Jahresende hat dein Körper deutlich signalisiert, dass er Erholung braucht, daher ist jetzt eine ruhigere Gangart und Regeneration angesagt. Lange Spaziergänge, Zeit mit einem Buch oder ein entspannendes Home-Spa helfen dir, dein Gleichgewicht wiederzufinden. Wenn möglich, plane einen kurzen Ausflug — selbst ein Wochenendtrip kann dir Ruhe und neue Energie schenken.",
      "aquarius": "Wassermann, in dieser Woche wirst du dich stark mit finanziellen Angelegenheiten beschäftigen, die dein Leben wesentlich beeinflussen können, besonders wenn du dir Zeit für eine sorgfältige Budgetanalyse und überlegte Entscheidungen nimmst. In Beziehungen werden deine Liebsten deine Aufmerksamkeit schätzen, und Gespräche mit ihnen stärken die Bindungen und bringen Zufriedenheit. Denke daran, das Gleichgewicht zwischen Arbeit und Privatleben zu wahren — Extreme sind nie gut. Wenn du unsicher bist, vertraue deiner Intuition, denn sie täuscht dich selten.",
      "pisces": "Fische, die kommende Zeit wird für dich eher nachdenklich sein. Es könnte sogar eine unerwartete Rückkehr einer Person aus deiner Vergangenheit geben. Ein Gespräch mit dieser Person kann dir Trost spenden oder wichtige Klarheit bringen, wenn du bereit bist, dich zu öffnen. Wahrscheinlich verspürst du das Bedürfnis, dich jemandem Nahestehenden anzuvertrauen — zögere nicht, dies zu tun. Die Unterstützung von vertrauenswürdigen Menschen, insbesondere von denen, die Situationen rationaler betrachten, kann sehr hilfreich sein. Der Jahresbeginn eignet sich gut, um Veränderungen vorzunehmen und neue Wege im Leben zu erkunden."
    }
  },
  "12.01.2026-18.01.2026": {
    "pl": {
      "aries": "Baranie, w tym tygodniu zwrócisz uwagę na bliskich, którzy życzą Ci jak najlepiej. Zrozumiesz, że czasem wystarczy jedna szczera rozmowa lub drobny gest, aby przywrócić harmonię w relacjach. Może pojawić się pewne zamieszanie w Twoim otoczeniu, ale Ty poczujesz przypływ energii i uda Ci się obronić swoje stanowisko. Pamiętaj też, aby nie być dla siebie zbyt surowym, nawet jeśli efekty Twoich działań wydają się niewielkie.",
      "taurus": "Byku, nadchodzący tydzień zapowiada się wyjątkowo korzystnie. Poznasz kilka interesujących osób, które wniosą świeżość i nowe perspektywy do Twojego życia. Dużo jednak zależy od Ciebie — Twoja intuicja będzie wyjątkowo wyczulona, pomagając podejmować ważne decyzje. Zaufaj swojemu wewnętrznemu głosowi, bo on wskaże Ci właściwą drogę.",
      "gemini": "Bliźniaku, nadchodzący tydzień sprzyja budowaniu i pielęgnowaniu relacji z bliskimi, na które ostatnio brakowało Ci czasu. Wykorzystaj każdą wolną chwilę, aby być z tymi, którzy są dla Ciebie ważni. Pamiętaj, że jeśli nic nie zrobisz i nie włożysz w to swojej inicjatywy, wiele szans może Cię ominąć. Dlatego odważ się chociaż trochę i po prostu ciesz się chwilą.",
      "cancer": "Raku, w tym tygodniu odczujesz przypływ energii i sił, ale również potrzebę dystansu od osób i sytuacji, które Cię przytłaczają. Spodziewaj się przygód, ekscytujących chwil i miłych niespodzianek. Spotykaj się ze znajomymi, wybierz się do kina i po prostu ciesz się życiem.",
      "leo": "Lwie, w tym tygodniu możesz odczuwać lekki niepokój i wrażenie, że tracisz kontrolę nad równowagą, co może wpływać na Twój spokój. Wystarczy jednak, że przetrwasz trudniejsze momenty. W sprawach sercowych bądź odważny i mów o swoich potrzebach — prawdziwa bliskość rodzi się z autentyczności, nie z wyidealizowanych słów. Znajdź też czas dla siebie, aby odzyskać wewnętrzną równowagę.",
      "virgo": "Panno, ten tydzień może być nieco wymagający. Pojawi się ktoś, kto sprawi, że poczujesz irytację i nerwowość, zwłaszcza w pracy i w kontaktach z innymi. Zastanów się, jak postępować, by w przyszłości unikać podobnych sytuacji. Spróbuj spojrzeć na niektóre sprawy z innej perspektywy — nawet drobna zmiana myślenia może otworzyć przed Tobą drzwi, które wcześniej wydawały się zamknięte.",
      "libra": "Wago, w nadchodzącym tygodniu relacje towarzyskie będą dla Ciebie sprzyjające. Teraz jest dobry moment na rozmowy — zarówno prywatne, jak i zawodowe — bo Twoje słowa będą trafne i budzące zaufanie. W kontaktach z innymi pojawi się potrzeba harmonii i szczerości, a drobny gest od bliskiej osoby może Cię miło zaskoczyć. W sprawach osobistych warto postawić na współpracę, zamiast rywalizacji, bo przyniesie to najlepsze efekty.",
      "scorpio": "Skorpionie, w nadchodzącym tygodniu skupisz się na pracy i choć nie wszystko będzie proste, Twoja determinacja oraz dobra organizacja pozwolą Ci szybko osiągnąć postęp. Wśród współpracowników poczujesz satysfakcję z dobrze wykonanych zadań. Relacje z innymi ułożą się korzystnie — sprzyjać będą rozmowy, współpraca i wzajemne zrozumienie. To również dobry czas na odnowienie kontaktów rodzinnych i załatwienie spraw, które wcześniej pozostały nierozwiązane.",
      "sagittarius": "Strzelcu, nadchodzący tydzień warto dobrze zaplanować. Zadbaj szczególnie o swoje zdrowie, bo jego stan wpływa na wiele innych obszarów życia. Nawet niewielkie zmiany w codziennych nawykach mogą przynieść zaskakująco pozytywne rezultaty. Wsłuchuj się w sygnały swojego ciała i nie odkładaj odpoczynku. Zaufaj swojej intuicji — wszystko potoczy się pomyślnie.",
      "capricorn": "Koziorożcu, w tym tygodniu zadbaj o odpoczynek i wewnętrzną równowagę, by utrzymać harmonię w codziennym życiu. W pracy pojawi się szansa, by pokazać swoje umiejętności i zwrócić uwagę przełożonych. Twoje spokój i konsekwencja okażą się kluczowe.",
      "aquarius": "Wodniku, w tym tygodniu spotkasz kogoś, kto skutecznie zmotywuje Cię do działania. Odpoczynek emocjonalny będzie równie ważny jak fizyczny, dlatego zwolnij tempo. Skup się na utrzymaniu spokoju w życiu i nie traktuj wszystkiego zbyt poważnie. Daj sobie luz i pozwól, by sprawy toczyły się naturalnym rytmem.",
      "pisces": "Rybo, w tym tygodniu poczujesz przypływ energii po spokojniejszym początku miesiąca. Twoja intuicja będzie działać wyjątkowo skutecznie i pomoże dostrzec rozwiązania tam, gdzie wcześniej panowała niepewność. W relacjach pojawi się więcej ciepła, a szczera rozmowa z bliskimi może przynieść istotne zrozumienie. To dobry czas na kreatywne działania, planowanie przyszłości i podejmowanie małych kroków, które z czasem przyniosą duże zmiany."
    },
    "en": {
      "aries": "Aries, this week you will focus on your loved ones who truly want the best for you. You’ll realize that sometimes a single sincere conversation or a small gesture is enough to restore harmony in your relationships. Some confusion may arise around you, but you’ll feel a surge of energy and manage to stand your ground. Remember not to be too hard on yourself, even if the results of your efforts seem limited.",
      "taurus": "Taurus, the upcoming week promises to be especially favorable for you. You will meet several interesting people who will bring freshness and new perspectives into your life. Much will also depend on you — your intuition will be highly alert, helping you make important decisions. Trust your inner voice, as it will guide you in the right direction.",
      "gemini": "Gemini, the upcoming week favors nurturing and strengthening your relationships with loved ones, which you’ve recently had little time for. Make the most of any free moments to spend with those who matter to you. Remember, if you take no action and give nothing of yourself, many opportunities may pass you by. So take a little courage and simply enjoy the moment.",
      "cancer": "Cancer, this week you may feel a surge of energy and strength, but also a need to distance yourself from people and situations that drain you. Expect adventures, exciting moments, and pleasant surprises. Meet up with friends, grab tickets for the cinema, and simply enjoy life.",
      "leo": "Leo, this week you may feel some anxiety and a sense that balance is slipping from your control, affecting your peace of mind. However, simply getting through the more challenging moments will help. In love, be brave and express your needs — true intimacy arises from authenticity, not from perfect words. Also, take a moment for yourself to restore your inner balance.",
      "virgo": "Virgo, this week might be a bit challenging. Someone may appear who causes you irritation and nervousness, especially at work and in interactions with others. Consider how to act to avoid similar situations in the future. Try to look at certain matters from a different perspective — even a small shift in thinking can open doors that previously seemed closed.",
      "libra": "Libra, the upcoming week will favor your social relationships. This is a good time for conversations — both personal and professional — as your words will be accurate and inspire trust. In your interactions, there will be a need for harmony and honesty, and a small gesture from someone close could pleasantly surprise you. In personal matters, focus on cooperation rather than competition, as this will bring the best results.",
      "scorpio": "Scorpio, this week you will focus on work, and although it won’t always be easy, your determination and good organization will help you make swift progress. Among colleagues, you will feel satisfaction from tasks well done. Your relationships with others will flow positively — conversations, collaboration, and mutual understanding will be favored. It’s also a good time to reconnect with family and address matters that were previously left unresolved.",
      "sagittarius": "Sagittarius, this week is worth planning carefully. Pay special attention to your health, as its condition affects many other areas of your life. Even small changes in daily habits can bring surprisingly positive results. Listen to the signals of your body and don’t postpone rest. Trust your intuition — things will go really well.",
      "capricorn": "Capricorn, this week, focus on rest and inner balance to maintain harmony in your daily life. At work, an opportunity will arise to showcase your skills and gain recognition from your superiors. Your calmness and consistency will prove to be your greatest assets.",
      "aquarius": "Aquarius, this week you will meet someone who will effectively motivate you to take action. Emotional rest will be just as important as physical, so slow down your pace. Focus on maintaining calm in your life and don’t take everything too seriously. Allow yourself to relax and let things unfold naturally.",
      "pisces": "Pisces, this week you will feel a surge of energy after a calmer start to the month. Your intuition will be especially strong, helping you see solutions where uncertainty previously prevailed. There will be more warmth in your relationships, and an honest conversation with loved ones can bring important understanding. This is a good time for creative actions, planning for the future, and taking small steps that will eventually lead to significant changes."
    },
    "de": {
      "aries": "Widder, in dieser Woche wirst du dich auf deine Liebsten konzentrieren, die nur das Beste für dich wollen. Du wirst erkennen, dass manchmal ein einziges aufrichtiges Gespräch oder eine kleine Geste ausreicht, um Harmonie in deinen Beziehungen wiederherzustellen. Es könnte etwas Verwirrung in deinem Umfeld geben, doch du wirst einen Energieschub spüren und es schaffen, deine Position zu behaupten. Denke daran, nicht zu streng mit dir selbst zu sein, auch wenn die Ergebnisse deiner Bemühungen gering erscheinen.",
      "taurus": "Stier, die kommende Woche wird für dich besonders günstig verlaufen. Du wirst einige interessante Menschen kennenlernen, die Frische und neue Perspektiven in dein Leben bringen. Vieles hängt jedoch auch von dir ab — deine Intuition wird besonders ausgeprägt sein und dir bei wichtigen Entscheidungen helfen. Vertraue auf deine innere Stimme, denn sie wird dich auf den richtigen Weg führen.",
      "gemini": "Zwillinge, die kommende Woche eignet sich besonders gut, um deine Beziehungen zu nahestehenden Menschen zu pflegen und zu stärken, für die du in letzter Zeit wenig Zeit hattest. Nutze jede freie Minute, um mit denen zusammen zu sein, die dir wichtig sind. Denke daran: Wenn du nichts unternimmst und nichts von dir gibst, könnten dir viele Chancen entgehen. Sei also ein wenig mutig und genieße den Moment.",
      "cancer": "Krebs, in dieser Woche wirst du einen Energieschub spüren, aber auch das Bedürfnis, dich von Menschen und Situationen zu distanzieren, die dich belasten. Erwarte Abenteuer, aufregende Momente und angenehme Überraschungen. Triff dich mit Freunden, besorge Kinokarten und genieße einfach das Leben.",
      "leo": "Löwe, in dieser Woche könntest du Unruhe verspüren und das Gefühl haben, dass die Balance dir entgleitet, was deinen inneren Frieden stören kann. Es genügt jedoch, die schwierigeren Momente zu überstehen. In der Liebe sei mutig und sprich über deine Bedürfnisse — wahre Nähe entsteht aus Authentizität, nicht aus perfekten Worten. Nimm dir außerdem einen Moment für dich, um dein inneres Gleichgewicht wiederzufinden.",
      "virgo": "Jungfrau, diese Woche könnte etwas anspruchsvoll sein. Jemand wird auftauchen, der dir Irritation und Nervosität bereitet, besonders bei der Arbeit und im Umgang mit anderen. Überlege, wie du handeln kannst, um ähnliche Situationen in Zukunft zu vermeiden. Versuche, manche Dinge aus einer anderen Perspektive zu betrachten — schon eine kleine Änderung der Denkweise kann Türen öffnen, die zuvor verschlossen schienen.",
      "libra": "Waage, die kommende Woche wird deine sozialen Beziehungen begünstigen. Jetzt ist ein guter Zeitpunkt für Gespräche — sowohl privat als auch beruflich — denn deine Worte werden treffend und vertrauenswürdig sein. In deinen Kontakten wird das Bedürfnis nach Harmonie und Ehrlichkeit spürbar, und eine kleine Geste einer nahestehenden Person könnte dich positiv überraschen. In persönlichen Angelegenheiten solltest du auf Zusammenarbeit statt auf Konkurrenz setzen, da dies die besten Ergebnisse bringt.",
      "scorpio": "Skorpion, in dieser Woche wirst du dich auf die Arbeit konzentrieren, und obwohl nicht alles einfach sein wird, helfen dir deine Entschlossenheit und gute Organisation, schnell Fortschritte zu erzielen. Bei den Kollegen wirst du Zufriedenheit über gut erledigte Aufgaben spüren. Deine Beziehungen zu anderen verlaufen günstig — Gespräche, Zusammenarbeit und gegenseitiges Verständnis werden gefördert. Dies ist auch eine gute Zeit, um Familienkontakte zu erneuern und Angelegenheiten zu klären, die zuvor ungelöst geblieben sind.",
      "sagittarius": "Schütze, diese Woche lohnt es sich, gut zu planen. Achte besonders auf deine Gesundheit, denn ihr Zustand wirkt sich auf viele andere Lebensbereiche aus. Selbst kleine Veränderungen in deinen täglichen Gewohnheiten können überraschend positive Ergebnisse bringen. Höre auf die Signale deines Körpers und verschiebe die Erholung nicht. Vertraue deiner Intuition — alles wird gut verlaufen.",
      "capricorn": "Steinbock, diese Woche solltest du auf Ruhe und innere Balance achten, um Harmonie im Alltag zu bewahren. Bei der Arbeit ergibt sich die Gelegenheit, deine Fähigkeiten zu zeigen und die Aufmerksamkeit deiner Vorgesetzten zu gewinnen. Ruhe und Konsequenz werden sich als deine größten Stärken erweisen.",
      "aquarius": "Wassermann, diese Woche wirst du jemanden treffen, der dich effektiv zur Tat motiviert. Emotionaler Rückzug ist genauso wichtig wie körperliche Erholung, also verlangsame dein Tempo. Konzentriere dich darauf, Ruhe in deinem Leben zu bewahren, und nimm nicht alles zu ernst. Gönne dir Gelassenheit und lass die Dinge auf natürliche Weise geschehen.",
      "pisces": "Fische, in dieser Woche wirst du nach einem ruhigeren Monatsbeginn einen deutlichen Energieschub verspüren. Deine Intuition ist besonders stark und hilft dir, Lösungen dort zu erkennen, wo zuvor Unsicherheit herrschte. In Beziehungen wird es wärmer, und ein ehrliches Gespräch mit nahestehenden Personen kann wichtiges Verständnis bringen. Dies ist eine gute Zeit für kreative Aktivitäten, Zukunftsplanung und kleine Schritte, die mit der Zeit zu großen Veränderungen führen werden."
    }
  }
}
